content/notas/SO/Notas.org
#+title: Sistemas Operativos
#+author: Erik Rangel Limón
#+startup: content
#+startup: latexpreview

* Bibliografía

  + Fundamentals of operating systems. Andrew Lister, R Eager. 5ta edición.
  + Operating System Concepts. Silberschatz el al. 8va edición.
  + Schaum's Outline of Operating Systems. J. Archer HArris. 1ra edición.
  
* Contacto

  - alanmartinez_012@ciencias.unam.mx

* Evaluación

  | Rubros    | Porcentaje |
  |-----------+------------|
  | Exámenes  |            |
  | parciales |         30 |
  |-----------+------------|
  | Tareas    |         35 |
  |-----------+------------|
  | Prácticas |         35 |

  Hay cuatro exámenes durante el curso.

  Hay una tarea cada dos semanas, una práctica cada dos semanas.

  Una vez se entregue alguna tarea, práctica o examen, ya no se tiene
  derecho a NP.
  
* Notas de Clase

** Clase 1
   
*** Temario

    1. Introducción

       1.1 Historia

       1.2 Procesos

    2. Núcleo

    3. Manejo de memoria

    4. Entrada - Salida

    5. Sistemas de archivos
   
*** Pintos.

    Desarrollado por la universidad de Stanford.
    
    Un kérnel semi-completo especializado para dar el curso de Sistemas
    Operativos.

    Tiene funciones incompletas o que funcionan mal para resolverlas a
    manera de práctica.

    Será utilizado para la parte práctica del curso.

    Está desarrollado en C y ensamblador, contiene mucho código.

** Laboratorio 1
   
*** Kérnel

    Es un programa que se encarga de administrar el hardware de una
    computadora.

    * CPU
      
    * Memoria principal

      - ROM

      - RAM

    * Entrada / Salida

*** Arranque de una computadora.

    El CPU en su registo =PC-IP= contiene la dirección hacia la ROM
    (memoria principal) la cual guarda la BIOS.

    La BIOS contiene órdenes para verificar el hardware que contiene
    una computadora y puede variar.

    Al final de este proceso, puede cargar el MBR del sistema
    operativo que esté guardado en una unidad de la meoria secundaria.

    El MBR se carga de cargar el Sistema Operativo (Kernel).

**** PCB

     /*Process Control Block*/

     De manera general es la siguiente.
     
      #+begin_src c
struct proceso{
  int ID;
  int prioridad;
  void* instruccion; // Es un apuntador que se entiende como una
		     // dirección de memoria
}
      #+end_src     

** Laboratorio 2

