notas/SO/Notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-19 Mon 12:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Sistemas Operativos</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Sistemas Operativos</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf4ac06">Bibliografía</a></li>
<li><a href="#org8c8f425">Contacto</a></li>
<li><a href="#orgad88554">Evaluación</a></li>
<li><a href="#org22f75fc">Notas de Clase</a>
<ul>
<li><a href="#orge43f7b5">Clase 1</a>
<ul>
<li><a href="#orgaf94e93">Temario</a></li>
<li><a href="#org37ecc06">Pintos.</a></li>
</ul>
</li>
<li><a href="#org930ae69">Laboratorio 1</a>
<ul>
<li><a href="#orgbf1795a">Kérnel</a></li>
<li><a href="#org938e82b">Arranque de una computadora.</a></li>
</ul>
</li>
<li><a href="#org03137b9">Laboratorio 2</a>
<ul>
<li><a href="#org866fcff">PCB en Pintos</a></li>
</ul>
</li>
<li><a href="#org00dc734">Clase 2</a>
<ul>
<li><a href="#orgc7bfb2d">Pefacio: Diferencias entre programas comunes y un Sistema Operativo</a></li>
<li><a href="#orga4eeb3f">Introducción</a></li>
</ul>
</li>
<li><a href="#orgce80f63">Laboratorio 3</a>
<ul>
<li><a href="#org9a86e7c">Bootstraping en Pintos</a></li>
<li><a href="#org9752edd">Manejo de threads en Pintos</a></li>
</ul>
</li>
<li><a href="#org79b371a">Clase 3</a>
<ul>
<li><a href="#org55f2bd9">Historia de los sistemas operativos</a></li>
</ul>
</li>
<li><a href="#org0fca76b">Clase 4</a>
<ul>
<li><a href="#orgb224109">Hoy en día los Sistemas Operativos</a></li>
<li><a href="#org9a4d153">Objetivos</a></li>
<li><a href="#org1e8faab">Estructura de computadoras</a></li>
<li><a href="#org233ac95">Definición de Sistema operativo</a></li>
</ul>
</li>
<li><a href="#org2d80a59">Clase 5</a>
<ul>
<li><a href="#orgc55a9f6">Definición de Sistemas Operativos</a></li>
<li><a href="#org6ae8d4a">Organización de computadoras</a></li>
</ul>
</li>
<li><a href="#orge3d10c9">Clase 6</a>
<ul>
<li><a href="#orgaee5de8">¿Qué es un sistema operativo?</a></li>
<li><a href="#org3226529">POSIX</a></li>
</ul>
</li>
<li><a href="#orgee02859">Clase 7</a>
<ul>
<li><a href="#orge8e03f1">Operación de Sistemas de Cómputo</a></li>
<li><a href="#org6198723">Funciones comunes de las interrupciones</a></li>
</ul>
</li>
<li><a href="#org069468c">Clase 8</a>
<ul>
<li><a href="#orgec2d335">¿Cómo trabaja una computadora moderna?</a></li>
</ul>
</li>
<li><a href="#orgf80ae4e">Laboratorio 4</a>
<ul>
<li><a href="#orgbccf33f">thread.c</a></li>
<li><a href="#orga547a5f">timer.c</a></li>
<li><a href="#org3ca515b">punto extra</a></li>
</ul>
</li>
<li><a href="#org324880a">Clase 9</a>
<ul>
<li><a href="#orgb9df6cb">Proceso</a></li>
<li><a href="#org6c533c8">Memoria en el sistema.</a></li>
</ul>
</li>
<li><a href="#orgf40d796">Clase 10</a>
<ul>
<li><a href="#org3deefe6">Ciclo de instrucciones del CPU</a></li>
<li><a href="#org0651c76">Interrupciones</a></li>
</ul>
</li>
<li><a href="#org9f16844">Clase 11</a>
<ul>
<li><a href="#orgdb47ed9">Capas del kérnel</a></li>
<li><a href="#orge573446">Jerarquía de los dispositivos de alacenamiento</a></li>
<li><a href="#orgbb47062">Sistemas Operativos de fuente abierta</a></li>
</ul>
</li>
<li><a href="#org9ff1506">Clase 12</a>
<ul>
<li><a href="#orgfb8a083">Proceso</a></li>
</ul>
</li>
<li><a href="#org21e2320">Clase 13</a>
<ul>
<li><a href="#org18f9609">Glosario</a></li>
</ul>
</li>
<li><a href="#orga0ee863">Clase 14</a>
<ul>
<li><a href="#org962cf79">Programa / rutina</a></li>
<li><a href="#orgb42c496">Procesador</a></li>
<li><a href="#orgdc6d227">Aplicación</a></li>
<li><a href="#org0267f5c">Concurrencia y no-determinismo</a></li>
<li><a href="#org59876a0">No determinismo</a></li>
</ul>
</li>
<li><a href="#orgc6be16a">Clase 15</a>
<ul>
<li><a href="#orgccfe495">Los procesos</a></li>
<li><a href="#orge983888">Semáforos</a></li>
</ul>
</li>
<li><a href="#org0aef197">Clase 16</a>
<ul>
<li><a href="#org15740be">wait(sem)</a></li>
<li><a href="#org5d892e0">Invariante</a></li>
<li><a href="#org168d3ee">Exclusión mutua</a></li>
</ul>
</li>
<li><a href="#orgc85396f">Laboratorio 5</a>
<ul>
<li><a href="#org0ef07f4">thread.c</a></li>
<li><a href="#org349176b">synch.c</a></li>
</ul>
</li>
<li><a href="#orgb3c3c33">Clase 17</a>
<ul>
<li><a href="#org7d9b896">Sincronización</a></li>
<li><a href="#org63f9350">Productores/Consumidor</a></li>
</ul>
</li>
<li><a href="#org7a41592">Clase 18</a>
<ul>
<li><a href="#orgbc90d9e">Solución Productores/consumidores</a></li>
</ul>
</li>
<li><a href="#org7b225d3">Laboratorio 6</a>
<ul>
<li><a href="#org9c8b31a">thread.c</a></li>
</ul>
</li>
<li><a href="#orgcbf556f">Clase 19</a>
<ul>
<li><a href="#org794a12c">Servicios del sistema</a></li>
</ul>
</li>
<li><a href="#org0c06a47">Clase 20</a>
<ul>
<li><a href="#org7d67a7d">MLFQ</a></li>
</ul>
</li>
<li><a href="#org2fe9513">Laboratiorio 7</a>
<ul>
<li><a href="#org0b70d51">¿Por qué no podemos usar floats?</a></li>
</ul>
</li>
<li><a href="#org54c677d">Clase 21</a>
<ul>
<li><a href="#orgb87215b">Manejador de interrupciones de primer nivel</a></li>
</ul>
</li>
<li><a href="#orgac6e2e1">Laboratiorio 8</a>
<ul>
<li><a href="#org32bf54a">Práctica 4: Sincronización</a></li>
</ul>
</li>
<li><a href="#org99586de">Clase 22</a>
<ul>
<li><a href="#org94d38a9">Sistemas operativos (repaso)</a></li>
</ul>
</li>
<li><a href="#org9b9d181">Clase 23</a>
<ul>
<li><a href="#org0f4c47c">Page Replacement</a></li>
</ul>
</li>
<li><a href="#orga7bf1e5">Clase 24</a>
<ul>
<li><a href="#orge14958c">Administración de memoria</a></li>
<li><a href="#org58ec2d6">Implementación de memoria virtual</a></li>
</ul>
</li>
<li><a href="#org8745b26">Clase 25</a>
<ul>
<li><a href="#orgee456e6">Implementación de memoria virtual</a></li>
</ul>
</li>
<li><a href="#org7d80e31">Clase 26</a>
<ul>
<li><a href="#org7eb39e1">Memoria virtual</a></li>
</ul>
</li>
<li><a href="#orgc58d370">Clase 27</a>
<ul>
<li><a href="#orgd085061">Memoria Virtual</a></li>
</ul>
</li>
<li><a href="#org7276fda">Clase 28</a>
<ul>
<li><a href="#org3e97dcc">Múltiples niveles de tablas</a></li>
</ul>
</li>
<li><a href="#orga3c9e48">Clase 29</a>
<ul>
<li><a href="#org83690e5">Paginación</a></li>
<li><a href="#org3e7c26e">Ejemplos de aplicaciones de paginación:</a></li>
<li><a href="#org6e1e694">Estrategias de reemplazo de página</a></li>
</ul>
</li>
<li><a href="#org1066eeb">Clase 30</a>
<ul>
<li><a href="#org9ab4abc">Estrategias que no usan estadísticas de uso</a></li>
<li><a href="#orgea3e538">Anomalía de Belady.</a></li>
<li><a href="#org8ce5eb6">Estrategias que sí usan estadísticas de uso</a></li>
</ul>
</li>
<li><a href="#org3d5c6dc">Clase 31</a>
<ul>
<li><a href="#org8026347">Descriptor de dispositivo</a></li>
</ul>
</li>
<li><a href="#orgf593add">Clase 32</a>
<ul>
<li><a href="#org9e54aa5">Examen Silver Chat</a></li>
<li><a href="#org1c68c90">Sobre la administración de memoria</a></li>
</ul>
</li>
<li><a href="#org7130bf4">Clase 33</a>
<ul>
<li><a href="#orgf98069f">El panorama de Entrada / Salida</a></li>
</ul>
</li>
<li><a href="#org30dfcf3">Clase 34</a>
<ul>
<li><a href="#org5b48c72">Dispositivos de Entrada y Salida</a></li>
<li><a href="#org34d3223">Unidad de transferencia</a></li>
<li><a href="#org342a77e">DOIO</a></li>
<li><a href="#org03e9fdb">Procedimiento re-entrante</a></li>
<li><a href="#orge9e8aba">Descriptor de dispositivo</a></li>
<li><a href="#org268bd04">Pasos del DOIO</a></li>
<li><a href="#org996e6c1">alanmart12</a></li>
</ul>
</li>
<li><a href="#org5031a98">Clase 35</a>
<ul>
<li><a href="#org80b7654">Preguntas</a></li>
</ul>
</li>
<li><a href="#orgcacc88c">Clase 36</a>
<ul>
<li><a href="#org229a695">Sistema de archivos</a></li>
<li><a href="#orgf69434c">Bloques secuenciales</a></li>
<li><a href="#orgc609348">Bloques enlazados</a></li>
<li><a href="#org8dac7c9">Tabla de asignación de archivo (FAT)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org9597a9c">Tareas <code>[4/5]</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbf4ac06" class="outline-2">
<h2 id="orgbf4ac06">Bibliografía</h2>
<div class="outline-text-2" id="text-orgbf4ac06">
<ul class="org-ul">
<li>Fundamentals of operating systems. Andrew Lister, R Eager. 5ta edición.</li>
<li>Operating System Concepts. Silberschatz el al. 8va edición.</li>
<li>Schaum's Outline of Operating Systems. J. Archer HArris. 1ra edición.</li>
</ul>
</div>
</div>

<div id="outline-container-org8c8f425" class="outline-2">
<h2 id="org8c8f425">Contacto</h2>
<div class="outline-text-2" id="text-org8c8f425">
<ul class="org-ul">
<li>alanmartinez<sub>012</sub>@ciencias.unam.mx</li>
</ul>
</div>
</div>

<div id="outline-container-orgad88554" class="outline-2">
<h2 id="orgad88554">Evaluación</h2>
<div class="outline-text-2" id="text-orgad88554">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rubros</th>
<th scope="col" class="org-right">Porcentaje</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Exámenes</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">parciales</td>
<td class="org-right">30</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tareas</td>
<td class="org-right">35</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Prácticas</td>
<td class="org-right">35</td>
</tr>
</tbody>
</table>

<p>
Hay cuatro exámenes durante el curso.
</p>

<p>
Hay una tarea cada dos semanas, una práctica cada dos semanas.
</p>

<p>
Una vez se entregue alguna tarea, práctica o examen, ya no se tiene
derecho a NP.
</p>
</div>
</div>

<div id="outline-container-org22f75fc" class="outline-2">
<h2 id="org22f75fc">Notas de Clase</h2>
<div class="outline-text-2" id="text-org22f75fc">
</div>
<div id="outline-container-orge43f7b5" class="outline-3">
<h3 id="orge43f7b5">Clase 1</h3>
<div class="outline-text-3" id="text-orge43f7b5">
</div>
<div id="outline-container-orgaf94e93" class="outline-4">
<h4 id="orgaf94e93">Temario</h4>
<div class="outline-text-4" id="text-orgaf94e93">
<ol class="org-ol">
<li><p>
Introducción
</p>

<p>
1.1 Historia
</p>

<p>
1.2 Procesos
</p></li>

<li>Núcleo</li>

<li>Manejo de memoria</li>

<li>Entrada - Salida</li>

<li>Sistemas de archivos</li>
</ol>
</div>
</div>

<div id="outline-container-org37ecc06" class="outline-4">
<h4 id="org37ecc06">Pintos.</h4>
<div class="outline-text-4" id="text-org37ecc06">
<p>
Desarrollado por la universidad de Stanford.
</p>

<p>
Un kérnel semi-completo especializado para dar el curso de Sistemas
Operativos.
</p>

<p>
Tiene funciones incompletas o que funcionan mal para resolverlas a
manera de práctica.
</p>

<p>
Será utilizado para la parte práctica del curso.
</p>

<p>
Está desarrollado en C y ensamblador, contiene mucho código.
</p>
</div>
</div>
</div>

<div id="outline-container-org930ae69" class="outline-3">
<h3 id="org930ae69">Laboratorio 1</h3>
<div class="outline-text-3" id="text-org930ae69">
</div>
<div id="outline-container-orgbf1795a" class="outline-4">
<h4 id="orgbf1795a">Kérnel</h4>
<div class="outline-text-4" id="text-orgbf1795a">
<p>
Es un programa que se encarga de administrar el hardware de una
computadora.
</p>

<ul class="org-ul">
<li>CPU</li>

<li>Memoria principal

<ul class="org-ul">
<li>ROM</li>

<li>RAM</li>
</ul></li>

<li>Entrada / Salida</li>
</ul>
</div>
</div>

<div id="outline-container-org938e82b" class="outline-4">
<h4 id="org938e82b">Arranque de una computadora.</h4>
<div class="outline-text-4" id="text-org938e82b">
<p>
El CPU en su registo <code>PC-IP</code> contiene la dirección hacia la ROM
(memoria principal) la cual guarda la BIOS.
</p>

<p>
La BIOS contiene órdenes para verificar el hardware que contiene
una computadora y puede variar.
</p>

<p>
Al final de este proceso, puede cargar el MBR del sistema
operativo que esté guardado en una unidad de la meoria secundaria.
</p>

<p>
El MBR se carga de cargar el Sistema Operativo (Kernel).
</p>
</div>

<ul class="org-ul">
<li><a id="org29d73aa"></a>PCB<br />
<div class="outline-text-5" id="text-org29d73aa">
<p>
<i><b>Process Control Block</b></i>
</p>

<p>
De manera general es la siguiente.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">proceso</span>{
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">ID</span>;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">prioridad</span>;
  <span style="font-weight: bold; text-decoration: underline;">void</span>* <span style="font-weight: bold; font-style: italic;">instruccion</span>; <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Es un apuntador que se entiende como una</span>
                     <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">direcci&#243;n de memoria</span>
}
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
