content/notas/SO/Notas.org
*** PCB en Pintos 

    Es algo así:
    
    #+begin_src c
struct thread{
  tid_t tid;
  enum thread status status;
  char name[16];
  uint8_t *stack;
  int priority;
  struct list_elem allelem;
  struct list_elem elem;
  
#ifdef USERPROG
  uint32_t *pagedir;
#endif
  
  unsigned magic;
}
    #+end_src

    Los procesos en pintos se inicializan de la siguiente manera:

    | 4 kB |                |
    |------+----------------|
    |      | kernel stack   | <- en este bloque se guardará la pila de ejecución
    |      | !              |
    |      | !              |
    |      | V              |
    |      | grows downward |
    |      |                |
    |      |                |
    |      |                |
    |      |                |
    |------+----------------|
    |      | magic          |  <- en este bloque almacenaremos el PCB
    |      | !              |
    |      | !              |
    |      | name           |
    |      | status         |
    | 0 kB |                |
    |------+----------------|

    Nuestro sistema operativa funciona a partir de procesos que sería
    nuestro =struct thread= el cual se guardará como en el diagrama, en
    un bloque de =4 kB=.
    
**** Pila de ejecución

     En ella se guardaran variables locales e identificadores de
     función.

**** Listas para usar en Pintos

     =all_list= contiene a todos los procesos.
     
     =ready_list= sólo vamos a tener todos los procesos que están listos
     para ejecutarse.

**** Thread unblock

     Lo que hace esta función es agregar nuestro /thread/ a la
     =ready_list=.

     En nuestro proceso de inicialización

** Clase 2

*** Pefacio: Diferencias entre programas comunes y un Sistema Operativo

    | Programa Usual                   | Sistema Operativo                      |
    |----------------------------------+----------------------------------------|
    | Todo es programado en lenguajes  | Mezcla de lenguajes de programación    |
    | de alto nivel                    | "sin runtime" combinado con uso        |
    |                                  | obligatorio de ensamblador             |
    |----------------------------------+----------------------------------------|
    | Tiene recursos lógicos de alto   | Tiene recursos de HW de bajo nivel     |
    | nivel como memoria dinámica,     | como administrador de                  |
    | archivos y directorios, sockets  | interrupciones, controlador de         |
    | , ventanas, canales de audio,    | memoria, controladores de              |
    | etc...                           | dispositivos.                          |
    |----------------------------------+----------------------------------------|
    | Modelo de programa de uno o      | Un único proceso con miles de tareas   |
    | varios hilos que apila sus       | (hilos) que se transfieren el control  |
    | llamadas subrutinas              | en puntos casi arbitrarios. Sus        |
    |                                  | subrutinas no se apilan necesariamente |
    |                                  | , sino que brinca de una a otra        |
    |                                  | (goto's/código espagheti).             |
    |----------------------------------+----------------------------------------|
    | Concurrencia inexistente, o      | Concurrencia explícita, sin mecanismos |
    | colaborativa con mecanismos de   | de sincronización existentes: tiene    |
    | sincronización de alto nivel     | que crearlos.                          |
    | (semáforos, candados, monitores) |                                        |
    |----------------------------------+----------------------------------------|
    | Algoritmos offline de tiempo de  | Algoritmo online de larga vida         |
    | vida preciso (Conocen toda su    | (Conocen su entrada por pedacitos y    |
    | entrada desde el inicio, la      | cada cierto tiempo deben dar           |
    | procesan y devuelven su salida)  | respuestas intentando predecir las     |
    |                                  | siguiente entradas. Terminan al apagar |
    |                                  | el sistema).                           |

*** Introducción

**** Historia de los sistemas operativos

     - Comenzó con el surgimiento de las computadoras en hardware
       en 1940.
     - ENIAC fue contruida en 1940, pesaba 30 toneladas, tenía 2
       metros de alto, 1 metro de profundidad y 33 mentro de longitud.
     - Contaba con más de 18,000 bublos que los enfriaban 80
       ventiladores.
     - Las computadoras inicialmente comenzaron usando bulbos.
     - Eventualmente cambió la forma de hacer programas, de hacer un
       recableado de la computadora a cargar datos por medio de
       tarjetas perforadas, para posteriormente pasar a cintas
       perforadas.
     - Posteriormente ya se utilizaron lectores de tarjetas,
       impresoras y nuidades de cinta magnética como elementos
       adicionales del hardware.
     - Finalmente, los ensambladares, cargadores y librerías de
       utilidades simples se desarrollaron como las primeras
       herramientas de software.

** Laboratorio 3

*** Bootstraping en Pintos

    Después de haber creado el thread idle, aloja la memoria
    necesaria, y finalmente /desbloquea/ el thread.

    La función thread espera al thread principal, y posteriormente lo
    bloquea y se invoca un "/halt/" desde el ensamblador.

