notas/SO/Notas.html

<div id="outline-container-org03137b9" class="outline-3">
<h3 id="org03137b9">Laboratorio 2</h3>
<div class="outline-text-3" id="text-org03137b9">
</div>
<div id="outline-container-org866fcff" class="outline-4">
<h4 id="org866fcff">PCB en Pintos</h4>
<div class="outline-text-4" id="text-org866fcff">
<p>
Es algo así:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>{
  <span style="font-weight: bold; text-decoration: underline;">tid_t</span> <span style="font-weight: bold; font-style: italic;">tid</span>;
  <span style="font-weight: bold;">enum</span> <span style="font-weight: bold; text-decoration: underline;">thread</span> <span style="font-weight: bold; font-style: italic;">status</span> status;
  <span style="font-weight: bold; text-decoration: underline;">char</span> <span style="font-weight: bold; font-style: italic;">name</span>[16];
  <span style="font-weight: bold; text-decoration: underline;">uint8_t</span> *<span style="font-weight: bold; font-style: italic;">stack</span>;
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">priority</span>;
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">list_elem</span> <span style="font-weight: bold; font-style: italic;">allelem</span>;
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">list_elem</span> <span style="font-weight: bold; font-style: italic;">elem</span>;

<span style="font-weight: bold;">#ifdef</span> USERPROG
  <span style="font-weight: bold; text-decoration: underline;">uint32_t</span> *<span style="font-weight: bold; font-style: italic;">pagedir</span>;
<span style="font-weight: bold;">#endif</span>

  <span style="font-weight: bold; text-decoration: underline;">unsigned</span> <span style="font-weight: bold; font-style: italic;">magic</span>;
}
</pre>
</div>

<p>
Los procesos en pintos se inicializan de la siguiente manera:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">4 kB</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">kernel stack</td>
<td class="org-left">&lt;- en este bloque se guardará la pila de ejecución</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">!</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">!</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">V</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">grows downward</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">magic</td>
<td class="org-left">&lt;- en este bloque almacenaremos el PCB</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">!</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">!</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">name</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">status</td>
</tr>

<tr>
<td class="org-left">0 kB</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Nuestro sistema operativa funciona a partir de procesos que sería
nuestro <code>struct thread</code> el cual se guardará como en el diagrama, en
un bloque de <code>4 kB</code>.
</p>
</div>

<ul class="org-ul">
<li><a id="org82cb71a"></a>Pila de ejecución<br />
<div class="outline-text-5" id="text-org82cb71a">
<p>
En ella se guardaran variables locales e identificadores de
función.
</p>
</div>
</li>

<li><a id="org632e9a8"></a>Listas para usar en Pintos<br />
<div class="outline-text-5" id="text-org632e9a8">
<p>
<code>all_list</code> contiene a todos los procesos.
</p>

<p>
<code>ready_list</code> sólo vamos a tener todos los procesos que están listos
para ejecutarse.
</p>
</div>
</li>

<li><a id="org70f7a22"></a>Thread unblock<br />
<div class="outline-text-5" id="text-org70f7a22">
<p>
Lo que hace esta función es agregar nuestro <i>thread</i> a la
<code>ready_list</code>.
</p>

<p>
En nuestro proceso de inicialización
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org00dc734" class="outline-3">
<h3 id="org00dc734">Clase 2</h3>
<div class="outline-text-3" id="text-org00dc734">
</div>
<div id="outline-container-orgc7bfb2d" class="outline-4">
<h4 id="orgc7bfb2d">Pefacio: Diferencias entre programas comunes y un Sistema Operativo</h4>
<div class="outline-text-4" id="text-orgc7bfb2d">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Programa Usual</th>
<th scope="col" class="org-left">Sistema Operativo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Todo es programado en lenguajes</td>
<td class="org-left">Mezcla de lenguajes de programación</td>
</tr>

<tr>
<td class="org-left">de alto nivel</td>
<td class="org-left">"sin runtime" combinado con uso</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">obligatorio de ensamblador</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tiene recursos lógicos de alto</td>
<td class="org-left">Tiene recursos de HW de bajo nivel</td>
</tr>

<tr>
<td class="org-left">nivel como memoria dinámica,</td>
<td class="org-left">como administrador de</td>
</tr>

<tr>
<td class="org-left">archivos y directorios, sockets</td>
<td class="org-left">interrupciones, controlador de</td>
</tr>

<tr>
<td class="org-left">, ventanas, canales de audio,</td>
<td class="org-left">memoria, controladores de</td>
</tr>

<tr>
<td class="org-left">etc&#x2026;</td>
<td class="org-left">dispositivos.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Modelo de programa de uno o</td>
<td class="org-left">Un único proceso con miles de tareas</td>
</tr>

<tr>
<td class="org-left">varios hilos que apila sus</td>
<td class="org-left">(hilos) que se transfieren el control</td>
</tr>

<tr>
<td class="org-left">llamadas subrutinas</td>
<td class="org-left">en puntos casi arbitrarios. Sus</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">subrutinas no se apilan necesariamente</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">, sino que brinca de una a otra</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(goto's/código espagheti).</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Concurrencia inexistente, o</td>
<td class="org-left">Concurrencia explícita, sin mecanismos</td>
</tr>

<tr>
<td class="org-left">colaborativa con mecanismos de</td>
<td class="org-left">de sincronización existentes: tiene</td>
</tr>

<tr>
<td class="org-left">sincronización de alto nivel</td>
<td class="org-left">que crearlos.</td>
</tr>

<tr>
<td class="org-left">(semáforos, candados, monitores)</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Algoritmos offline de tiempo de</td>
<td class="org-left">Algoritmo online de larga vida</td>
</tr>

<tr>
<td class="org-left">vida preciso (Conocen toda su</td>
<td class="org-left">(Conocen su entrada por pedacitos y</td>
</tr>

<tr>
<td class="org-left">entrada desde el inicio, la</td>
<td class="org-left">cada cierto tiempo deben dar</td>
</tr>

<tr>
<td class="org-left">procesan y devuelven su salida)</td>
<td class="org-left">respuestas intentando predecir las</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">siguiente entradas. Terminan al apagar</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">el sistema).</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga4eeb3f" class="outline-4">
<h4 id="orga4eeb3f">Introducción</h4>
<div class="outline-text-4" id="text-orga4eeb3f">
</div>
<ul class="org-ul">
<li><a id="org73588f4"></a>Historia de los sistemas operativos<br />
<div class="outline-text-5" id="text-org73588f4">
<ul class="org-ul">
<li>Comenzó con el surgimiento de las computadoras en hardware
en 1940.</li>
<li>ENIAC fue contruida en 1940, pesaba 30 toneladas, tenía 2
metros de alto, 1 metro de profundidad y 33 mentro de longitud.</li>
<li>Contaba con más de 18,000 bublos que los enfriaban 80
ventiladores.</li>
<li>Las computadoras inicialmente comenzaron usando bulbos.</li>
<li>Eventualmente cambió la forma de hacer programas, de hacer un
recableado de la computadora a cargar datos por medio de
tarjetas perforadas, para posteriormente pasar a cintas
perforadas.</li>
<li>Posteriormente ya se utilizaron lectores de tarjetas,
impresoras y nuidades de cinta magnética como elementos
adicionales del hardware.</li>
<li>Finalmente, los ensambladares, cargadores y librerías de
utilidades simples se desarrollaron como las primeras
herramientas de software.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgce80f63" class="outline-3">
<h3 id="orgce80f63">Laboratorio 3</h3>
<div class="outline-text-3" id="text-orgce80f63">
</div>
<div id="outline-container-org9a86e7c" class="outline-4">
<h4 id="org9a86e7c">Bootstraping en Pintos</h4>
<div class="outline-text-4" id="text-org9a86e7c">
<p>
Después de haber creado el thread idle, aloja la memoria
necesaria, y finalmente <i>desbloquea</i> el thread.
</p>

<p>
La función thread espera al thread principal, y posteriormente lo
bloquea y se invoca un "<i>halt</i>" desde el ensamblador.
</p>
</div>
</div>
