content/notas/SO/Notas.org
*** Manejo de threads en Pintos

    Para que el sistema operativo evite que un proceso utilice más cpu
    de lo esperado se utiliza un Timer, el cual mandará una
    /interrupción/ para determinar que el proceso debe hace ahora otra
    cosa.

    Pintos cuenta con un manejador de interrupciones, el cual tiene un
    contador de ticks y por defecto a cada proceso le da un total de
    un 4 ticks, para después mandar llamar al respectivo manejador y
    manda a llamar a la función =thread yield=.

    Si el thread actual no es el "idle", entonces se agrega a la ready
    list. Lo que permite que el Kernel le ayude a asignar su
    respectivo thread.

    El timer_sleep funciona de tal manera que, recibe una cantidad de
    ticks; inicia un timer, y posteriormente el proceso se agrega a la
    ready_list, si todavía no a pasado el tiempo necesario, entonces
    de vuelve a agregar a la ready_list, y así sucesivamente hasta que
    ha pasado el tiempo suficiente.

** Clase 3

*** Historia de los sistemas operativos

    - Finalmente, surgió la idea de la multiprogramación.
      
    - En lugar de tener un sólo proceso ahora se cargaban varios
      procesos de manera simultánea, dividiendo los recursos de la
      computadora.
      
    - Mientras un proceso está haciendo un trabajo de I/O, el sistema
      operativo elige a tro proceso para ejecutarse hasta que el
      proceso actual a otra operación I/O.

    - Con el desarrollo de computación interactiva en 1970, emergieron
      los sistemas de tiempo compartido.

    - En estos sistemas, había múltiples usuarios con acceso a una
      terminal (que no es una computadora) conectada a una computadora
      principal.

    - Otro tipo de computadora son los sistemas multiprocesador, que
      como su nombre o dice, tiene múltiples procesadores que
      comparten memoria y dispositivos periféricos.

    - Con esta configuración, éstas computadoras tuvieron mejor poder
      de computación.

** Clase 4
   
*** Hoy en día los Sistemas Operativos

    - Carga programas y los ejecuta
    - Les da memoria
    - Les asigna tiempo de procesador
    - Les permite comunicarse
    - Los elimina
    - Controla los dispositivos
    - Provee E/S de alto nivel (archivos, sockets)
    - Ofrece recursos gráfica (ventanas)
    - Administra energía
    - Tareas administrativas, cuyo propósito final es permitir que
      haya aplicaciones.

*** Objetivos

    - Mostrar el panorama de los componentes más importantes de los
      sitemas operativos.
    - Dar principios elementales de organización.

*** Estructura de computadoras

    - Un sistema de cómputo se puede dividir en cuatro componentes:

      + Hardware - ofrece recursos de cómputo elementales

	CPU, memorio, Dispositivos E/S

      + Sistema Operativo

	Controla y coordina el uso de hardware entre varias
        aplicaciones y usuarios

      + Programas de aplicación - Definen la manera en que los
        recursos de cómputo son usados para resolver los problemas de
        los usuarios.

	Procesadores de texto, compiladores, navegadores web, videojuegos

      + Usuarios

	Gente, máquinas, otras computadoras.


    | Software     | Kernel          |
    |--------------+-----------------|
    | Hardware     |                 |
    |--------------+-----------------|
    | Modo usuario | Modo supervisor |

*** Definición de Sistema operativo

    - Es un asignador de recursos

      + Administra todos los recursos

      + Decide entre solicituden en conflicto para un uso justo y
        eficiente de los recursos.

    - Es un programa de control

      + Controla la ejecución de programas para prevenir errores y un
        uso impropio de la computadora.

** Clase 5
*** Definición de Sistemas Operativos

    - No hay una definición aceptada universalmente.
      
    - "Todo lo que un vendedor incluye cuando ordenas un sistema
      operativo" es una primera aproximación

      - Pero cada vez se incluyen más extras

    - "El programa que corre todo el tiempo" es el kernel. Todo lo
      demás (ejecutable) es un programa del sistema (viene con el
      sistema operativo) o un programa de aplicación.

    - "Un sistema operativo es como un gobierno".

*** Organización de computadoras
      
    - Operación de un sistema de cómputo

      - Uno o más CPUs y controladores de dispositivos se conectan a
        un bus común brindando acceso a una memoria compartida,

      - Ejecución concurrente de CPUs y dispositivos compitiendo por
        ciclos de la memoria.

** Clase 6
*** ¿Qué es un sistema operativo?

   - Un programa que administra y gestiona los recursos.

     Éstos recursos son requeridos por los procesos.

     Un proceso tiene varias definiciones también.

     + _Programa en ejecución_

     + Cambio en el estado de la memoria por acción del procesador.

     Un recurso va a ser el tiempo de uso del procesador.

     Los procesos por lo generalmente son extremadamente rápidos, pero
     éstos pueden usar muchos recursos.

   - La gestión de recursos de hacen mediante algoritmos de
     calendarización.

   - También un sistema operativo es encargado de la seguridad de un
     sistema.

   - Empareja el terreno entre le usuario, los programas de aplicación
     y el hardware.
     
*** POSIX

    /Portable Operating System Interface/

    Antes los Sistemas Operativos eran específicos del Harware, y la
    llegada de éste se hizo para el uso general en cualquier
    computadora de su tiempo.

** Clase 7
*** Operación de Sistemas de Cómputo

    - Los dispositivos de E/S y los CPUs se puede ejecutar
      simutáneamente.

    - Cada controlador de dispositivo está a cargo de un tipo de
      dispositivo particular.

    - Cada controlador de dispositivo tiene un buffer local.

    - El CPU mueve datos desde/hacia memoria principal hacia/desde
      buffers locales.

    - La E/S es del dispositivo al buffer local del controlador.

    - El controlador de dispositivo informa al CPU que ha terminado su
      operación causando una /interrupción/.
      
