notas/SO/Notas.html

<div id="outline-container-org9752edd" class="outline-4">
<h4 id="org9752edd">Manejo de threads en Pintos</h4>
<div class="outline-text-4" id="text-org9752edd">
<p>
Para que el sistema operativo evite que un proceso utilice más cpu
de lo esperado se utiliza un Timer, el cual mandará una
<i>interrupción</i> para determinar que el proceso debe hace ahora otra
cosa.
</p>

<p>
Pintos cuenta con un manejador de interrupciones, el cual tiene un
contador de ticks y por defecto a cada proceso le da un total de
un 4 ticks, para después mandar llamar al respectivo manejador y
manda a llamar a la función <code>thread yield</code>.
</p>

<p>
Si el thread actual no es el "idle", entonces se agrega a la ready
list. Lo que permite que el Kernel le ayude a asignar su
respectivo thread.
</p>

<p>
El timer<sub>sleep</sub> funciona de tal manera que, recibe una cantidad de
ticks; inicia un timer, y posteriormente el proceso se agrega a la
ready<sub>list</sub>, si todavía no a pasado el tiempo necesario, entonces
de vuelve a agregar a la ready<sub>list</sub>, y así sucesivamente hasta que
ha pasado el tiempo suficiente.
</p>
</div>
</div>
</div>

<div id="outline-container-org79b371a" class="outline-3">
<h3 id="org79b371a">Clase 3</h3>
<div class="outline-text-3" id="text-org79b371a">
</div>
<div id="outline-container-org55f2bd9" class="outline-4">
<h4 id="org55f2bd9">Historia de los sistemas operativos</h4>
<div class="outline-text-4" id="text-org55f2bd9">
<ul class="org-ul">
<li>Finalmente, surgió la idea de la multiprogramación.</li>

<li>En lugar de tener un sólo proceso ahora se cargaban varios
procesos de manera simultánea, dividiendo los recursos de la
computadora.</li>

<li>Mientras un proceso está haciendo un trabajo de I/O, el sistema
operativo elige a tro proceso para ejecutarse hasta que el
proceso actual a otra operación I/O.</li>

<li>Con el desarrollo de computación interactiva en 1970, emergieron
los sistemas de tiempo compartido.</li>

<li>En estos sistemas, había múltiples usuarios con acceso a una
terminal (que no es una computadora) conectada a una computadora
principal.</li>

<li>Otro tipo de computadora son los sistemas multiprocesador, que
como su nombre o dice, tiene múltiples procesadores que
comparten memoria y dispositivos periféricos.</li>

<li>Con esta configuración, éstas computadoras tuvieron mejor poder
de computación.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0fca76b" class="outline-3">
<h3 id="org0fca76b">Clase 4</h3>
<div class="outline-text-3" id="text-org0fca76b">
</div>
<div id="outline-container-orgb224109" class="outline-4">
<h4 id="orgb224109">Hoy en día los Sistemas Operativos</h4>
<div class="outline-text-4" id="text-orgb224109">
<ul class="org-ul">
<li>Carga programas y los ejecuta</li>
<li>Les da memoria</li>
<li>Les asigna tiempo de procesador</li>
<li>Les permite comunicarse</li>
<li>Los elimina</li>
<li>Controla los dispositivos</li>
<li>Provee E/S de alto nivel (archivos, sockets)</li>
<li>Ofrece recursos gráfica (ventanas)</li>
<li>Administra energía</li>
<li>Tareas administrativas, cuyo propósito final es permitir que
haya aplicaciones.</li>
</ul>
</div>
</div>

<div id="outline-container-org9a4d153" class="outline-4">
<h4 id="org9a4d153">Objetivos</h4>
<div class="outline-text-4" id="text-org9a4d153">
<ul class="org-ul">
<li>Mostrar el panorama de los componentes más importantes de los
sitemas operativos.</li>
<li>Dar principios elementales de organización.</li>
</ul>
</div>
</div>

<div id="outline-container-org1e8faab" class="outline-4">
<h4 id="org1e8faab">Estructura de computadoras</h4>
<div class="outline-text-4" id="text-org1e8faab">
<ul class="org-ul">
<li>Un sistema de cómputo se puede dividir en cuatro componentes:

<ul class="org-ul">
<li><p>
Hardware - ofrece recursos de cómputo elementales
</p>

<p>
CPU, memorio, Dispositivos E/S
</p></li>

<li><p>
Sistema Operativo
</p>

<p>
Controla y coordina el uso de hardware entre varias
aplicaciones y usuarios
</p></li>

<li><p>
Programas de aplicación - Definen la manera en que los
recursos de cómputo son usados para resolver los problemas de
los usuarios.
</p>

<p>
Procesadores de texto, compiladores, navegadores web, videojuegos
</p></li>

<li><p>
Usuarios
</p>

<p>
Gente, máquinas, otras computadoras.
</p></li>
</ul></li>
</ul>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Software</th>
<th scope="col" class="org-left">Kernel</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Hardware</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Modo usuario</td>
<td class="org-left">Modo supervisor</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org233ac95" class="outline-4">
<h4 id="org233ac95">Definición de Sistema operativo</h4>
<div class="outline-text-4" id="text-org233ac95">
<ul class="org-ul">
<li>Es un asignador de recursos

<ul class="org-ul">
<li>Administra todos los recursos</li>

<li>Decide entre solicituden en conflicto para un uso justo y
eficiente de los recursos.</li>
</ul></li>

<li>Es un programa de control

<ul class="org-ul">
<li>Controla la ejecución de programas para prevenir errores y un
uso impropio de la computadora.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2d80a59" class="outline-3">
<h3 id="org2d80a59">Clase 5</h3>
<div class="outline-text-3" id="text-org2d80a59">
</div>
<div id="outline-container-orgc55a9f6" class="outline-4">
<h4 id="orgc55a9f6">Definición de Sistemas Operativos</h4>
<div class="outline-text-4" id="text-orgc55a9f6">
<ul class="org-ul">
<li>No hay una definición aceptada universalmente.</li>

<li>"Todo lo que un vendedor incluye cuando ordenas un sistema
operativo" es una primera aproximación

<ul class="org-ul">
<li>Pero cada vez se incluyen más extras</li>
</ul></li>

<li>"El programa que corre todo el tiempo" es el kernel. Todo lo
demás (ejecutable) es un programa del sistema (viene con el
sistema operativo) o un programa de aplicación.</li>

<li>"Un sistema operativo es como un gobierno".</li>
</ul>
</div>
</div>

<div id="outline-container-org6ae8d4a" class="outline-4">
<h4 id="org6ae8d4a">Organización de computadoras</h4>
<div class="outline-text-4" id="text-org6ae8d4a">
<ul class="org-ul">
<li>Operación de un sistema de cómputo

<ul class="org-ul">
<li>Uno o más CPUs y controladores de dispositivos se conectan a
un bus común brindando acceso a una memoria compartida,</li>

<li>Ejecución concurrente de CPUs y dispositivos compitiendo por
ciclos de la memoria.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge3d10c9" class="outline-3">
<h3 id="orge3d10c9">Clase 6</h3>
<div class="outline-text-3" id="text-orge3d10c9">
</div>
<div id="outline-container-orgaee5de8" class="outline-4">
<h4 id="orgaee5de8">¿Qué es un sistema operativo?</h4>
<div class="outline-text-4" id="text-orgaee5de8">
<ul class="org-ul">
<li><p>
Un programa que administra y gestiona los recursos.
</p>

<p>
Éstos recursos son requeridos por los procesos.
</p>

<p>
Un proceso tiene varias definiciones también.
</p>

<ul class="org-ul">
<li><span class="underline">Programa en ejecución</span></li>

<li>Cambio en el estado de la memoria por acción del procesador.</li>
</ul>

<p>
Un recurso va a ser el tiempo de uso del procesador.
</p>

<p>
Los procesos por lo generalmente son extremadamente rápidos, pero
éstos pueden usar muchos recursos.
</p></li>

<li>La gestión de recursos de hacen mediante algoritmos de
calendarización.</li>

<li>También un sistema operativo es encargado de la seguridad de un
sistema.</li>

<li>Empareja el terreno entre le usuario, los programas de aplicación
y el hardware.</li>
</ul>
</div>
</div>

<div id="outline-container-org3226529" class="outline-4">
<h4 id="org3226529">POSIX</h4>
<div class="outline-text-4" id="text-org3226529">
<p>
<i>Portable Operating System Interface</i>
</p>

<p>
Antes los Sistemas Operativos eran específicos del Harware, y la
llegada de éste se hizo para el uso general en cualquier
computadora de su tiempo.
</p>
</div>
</div>
</div>

<div id="outline-container-orgee02859" class="outline-3">
<h3 id="orgee02859">Clase 7</h3>
<div class="outline-text-3" id="text-orgee02859">
</div>
<div id="outline-container-orge8e03f1" class="outline-4">
<h4 id="orge8e03f1">Operación de Sistemas de Cómputo</h4>
<div class="outline-text-4" id="text-orge8e03f1">
<ul class="org-ul">
<li>Los dispositivos de E/S y los CPUs se puede ejecutar
simutáneamente.</li>

<li>Cada controlador de dispositivo está a cargo de un tipo de
dispositivo particular.</li>

<li>Cada controlador de dispositivo tiene un buffer local.</li>

<li>El CPU mueve datos desde/hacia memoria principal hacia/desde
buffers locales.</li>

<li>La E/S es del dispositivo al buffer local del controlador.</li>

<li>El controlador de dispositivo informa al CPU que ha terminado su
operación causando una <i>interrupción</i>.</li>
</ul>
</div>
</div>
