content/notas/SO/Notas.org
*** Funciones comunes de las interrupciones

    - Generalmente transfieren el control a la rutina de servicio de
      interrupción.
      
    - El sistema de interrupciones debe guardar la dirección de la
      intrucción interrumpida.

    - Las demás interrupciones son deshabilitadas mientras otra
      interrupción está siendo procesada para prevenir una pérdida de
      información.

    - Una trampa es una interrupción generada por software causada por
      un error o una solicitud.

    - Una llamada al sistema es una /trampa/ que es activada por un
      proceso para solicitar un servicio al Sistema Operativo.

    - *Un sistema de cómputo es dirigido por interrupciones.*

** Clase 8
*** ¿Cómo trabaja una computadora moderna?

    Cada procesador tiene una forma distinta de comunicarse con los
    dispositivos, pero todos acceden a la misma memoria.

    un núcleo puede estar desocupado, ejecutando una rutina de
    servicio de interrupción o ejecutando un proceso de usuario o de
    kérnel.
** Laboratorio 4
*** thread.c

    #+begin_src c
timer_interrupt(struct init_frame *args UNUSED){
  ticks++;
  thread_tick();
  struct list_elem* nodo = list_begin(&dormidos);
  while(nodo != list_end(&dormidos)){
    struct thread* t = list_entry(nodo, struct thread, elem);
    t->por dormir --;
    if (t->por_dormir <= 0){
      nodo = list_remove(nodo);
      thread_unblock(t);
    }else{
      nodo = list_next(nodo);
    }
  }
}
    #+end_src
    
*** timer.c

    #+begin_src c
void timer_sleep (int64_t ticks){
  int64_t start = timer_ticks();
  ASSERT (intr_get_level() == INTR_ON);
  enum intr_level old = intr_set_level(INTR_OFF);
  struct thread* t = thread_current();
  t->por_dormir = ticks;
  list_push_back(&dormidos, &thread_current()->elem);
  thread_block();
  intr_set_level(old);
}
    #+end_src

*** punto extra

    #+begin_src c
struct dormido{
  int64_t ticks;
  struct thread* t;
  struct list_elem elem;
}

struct dormido d;
d->ticks = ticks;
d->t = thread_current();
list_push_back(&dormidos, &thread_current()->elem);
    #+end_src

** Clase 9
*** Proceso

    - Un proceso va a ser un programa en ejecución.

      - El kérnel es un programa que siempre se está ejecutando en una
        computadora.
	
*** Memoria en el sistema.

    - Primaria:

      Suelen no se suficientemente amplios para alamacenar los datos
      de los programas necesarios.

      Suelen ser memorias volátiles; la cual no conserva lo almacenado
      si no hay flujo de energía.

      Por lo general utilizan una dinámica de acceoso aleatorio, pero
      no necesariamente.

      Ésta memoria se encuentra más cerca del procesador.
    
      Algunos ejemplos pueden ser la RAM, la memoria Caché y los
      Registros.
      
    - Secundaria:

      Por lo general tiene mayor capacidad de almacenamiento que la
      memoria primaria, esto pues su principal función es la de
      resguardar la información.

      Éstas unidades no son volátiles.

      Las operaciones más costosas en recursos del Sistema Operativo
      son las de accesso y escritura directos al disco duro.


    Los procesos necesitan tiempo de uso de procesador, y todo proceso
    pasa por el porcesador.

    Sin embargo no todo proceso pasa por la RAM, sino puede utilizar
    alguna otra de las memorias principales.

** Clase 10
*** Ciclo de instrucciones del CPU
    
**** Fetch

     Éste consiste en obtener o buscar las instrucciones.

**** Decode

     Ver de qué trata la instrucción.

**** Execute

     Ejecutar la instrucción.

**** Write

     En caso de ser necesario para el proceso.

*** Interrupciones

    El proceso de interrupciones del sistema consiste en detener una
    tarea para realizar otra con mayor importancia o interrumpir por
    conveniencia del sistema.

    Por lo general son impulsos/señales eléctricas.

    El proceso de interrupciones consta de los siguientes pasos:

    1. El hardware/software tiene un proceso llamado "solicitud de
       interrupción" en el que la CPU detecta después de ejecutar una
       instrucción.

    2. Sí hay una interrupción, la CPU detecta que un "controlador de
       dispositivo" a firmado una solicitud de interrupción lee el
       número de interrupción, "salta" a la interrupción misma y traza
       un "vector de interrupción".

       El vector de interrupción consta de información importante;
       hacia dónde va la interrupción, de dónde viene y una copia del
       estado del proceso.


    En Sistemas Operativos modernos se necesitan añadir las siguientes
    características para un manejo más sofisticado de las
    interrupciones:

    1. Tener la capacidad de diferir el manejo de la interrupción
       durante el proceso crítico.
       
    2. Tener interrupciones _multinivel_ para que el Sistema Operativo
       pueda distinguir entre interrupciones de _alta_ y _baja_ prioridad.

    3. Tener una forma eficiente de enviar una interrupción adecuada
       para cada dispositivo.

** Clase 11
*** Capas del kérnel
    
**** Núcleo

     Permite que los procesos existan como entidades calendarizables.

     En éste núcleo se pueden ejecutar instrucciones privilegiadas.

**** Memoria

     Permite asignar memoria dinámica a los procesos.

