notas/SO/Notas.html

<div id="outline-container-org6198723" class="outline-4">
<h4 id="org6198723">Funciones comunes de las interrupciones</h4>
<div class="outline-text-4" id="text-org6198723">
<ul class="org-ul">
<li>Generalmente transfieren el control a la rutina de servicio de
interrupción.</li>

<li>El sistema de interrupciones debe guardar la dirección de la
intrucción interrumpida.</li>

<li>Las demás interrupciones son deshabilitadas mientras otra
interrupción está siendo procesada para prevenir una pérdida de
información.</li>

<li>Una trampa es una interrupción generada por software causada por
un error o una solicitud.</li>

<li>Una llamada al sistema es una <i>trampa</i> que es activada por un
proceso para solicitar un servicio al Sistema Operativo.</li>

<li><b>Un sistema de cómputo es dirigido por interrupciones.</b></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org069468c" class="outline-3">
<h3 id="org069468c">Clase 8</h3>
<div class="outline-text-3" id="text-org069468c">
</div>
<div id="outline-container-orgec2d335" class="outline-4">
<h4 id="orgec2d335">¿Cómo trabaja una computadora moderna?</h4>
<div class="outline-text-4" id="text-orgec2d335">
<p>
Cada procesador tiene una forma distinta de comunicarse con los
dispositivos, pero todos acceden a la misma memoria.
</p>

<p>
un núcleo puede estar desocupado, ejecutando una rutina de
servicio de interrupción o ejecutando un proceso de usuario o de
kérnel.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf80ae4e" class="outline-3">
<h3 id="orgf80ae4e">Laboratorio 4</h3>
<div class="outline-text-3" id="text-orgf80ae4e">
</div>
<div id="outline-container-orgbccf33f" class="outline-4">
<h4 id="orgbccf33f">thread.c</h4>
<div class="outline-text-4" id="text-orgbccf33f">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">timer_interrupt</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">init_frame</span> *<span style="font-weight: bold; font-style: italic;">args</span> UNUSED){
  ticks++;
  thread_tick();
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">list_elem</span>* <span style="font-weight: bold; font-style: italic;">nodo</span> = list_begin(&amp;dormidos);
  <span style="font-weight: bold;">while</span>(nodo != list_end(&amp;dormidos)){
    <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>* <span style="font-weight: bold; font-style: italic;">t</span> = list_entry(nodo, <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>, elem);
    t-&gt;por dormir --;
    <span style="font-weight: bold;">if</span> (t-&gt;por_dormir &lt;= 0){
      nodo = list_remove(nodo);
      thread_unblock(t);
    }<span style="font-weight: bold;">else</span>{
      nodo = list_next(nodo);
    }
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga547a5f" class="outline-4">
<h4 id="orga547a5f">timer.c</h4>
<div class="outline-text-4" id="text-orga547a5f">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">timer_sleep</span> (<span style="font-weight: bold; text-decoration: underline;">int64_t</span> <span style="font-weight: bold; font-style: italic;">ticks</span>){
  <span style="font-weight: bold; text-decoration: underline;">int64_t</span> <span style="font-weight: bold; font-style: italic;">start</span> = timer_ticks();
  ASSERT (intr_get_level() == INTR_ON);
  <span style="font-weight: bold;">enum</span> <span style="font-weight: bold; text-decoration: underline;">intr_level</span> <span style="font-weight: bold; font-style: italic;">old</span> = intr_set_level(INTR_OFF);
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>* <span style="font-weight: bold; font-style: italic;">t</span> = thread_current();
  t-&gt;por_dormir = ticks;
  list_push_back(&amp;dormidos, &amp;thread_current()-&gt;elem);
  thread_block();
  intr_set_level(old);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ca515b" class="outline-4">
<h4 id="org3ca515b">punto extra</h4>
<div class="outline-text-4" id="text-org3ca515b">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">dormido</span>{
  <span style="font-weight: bold; text-decoration: underline;">int64_t</span> <span style="font-weight: bold; font-style: italic;">ticks</span>;
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>* <span style="font-weight: bold; font-style: italic;">t</span>;
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">list_elem</span> <span style="font-weight: bold; font-style: italic;">elem</span>;
}

<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">dormido</span> <span style="font-weight: bold; font-style: italic;">d</span>;
d-&gt;ticks = ticks;
d-&gt;t = thread_current();
list_push_back(&amp;dormidos, &amp;thread_current()-&gt;elem);
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org324880a" class="outline-3">
<h3 id="org324880a">Clase 9</h3>
<div class="outline-text-3" id="text-org324880a">
</div>
<div id="outline-container-orgb9df6cb" class="outline-4">
<h4 id="orgb9df6cb">Proceso</h4>
<div class="outline-text-4" id="text-orgb9df6cb">
<ul class="org-ul">
<li>Un proceso va a ser un programa en ejecución.

<ul class="org-ul">
<li>El kérnel es un programa que siempre se está ejecutando en una
computadora.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6c533c8" class="outline-4">
<h4 id="org6c533c8">Memoria en el sistema.</h4>
<div class="outline-text-4" id="text-org6c533c8">
<ul class="org-ul">
<li><p>
Primaria:
</p>

<p>
Suelen no se suficientemente amplios para alamacenar los datos
de los programas necesarios.
</p>

<p>
Suelen ser memorias volátiles; la cual no conserva lo almacenado
si no hay flujo de energía.
</p>

<p>
Por lo general utilizan una dinámica de acceoso aleatorio, pero
no necesariamente.
</p>

<p>
Ésta memoria se encuentra más cerca del procesador.
</p>

<p>
Algunos ejemplos pueden ser la RAM, la memoria Caché y los
Registros.
</p></li>

<li><p>
Secundaria:
</p>

<p>
Por lo general tiene mayor capacidad de almacenamiento que la
memoria primaria, esto pues su principal función es la de
resguardar la información.
</p>

<p>
Éstas unidades no son volátiles.
</p>

<p>
Las operaciones más costosas en recursos del Sistema Operativo
son las de accesso y escritura directos al disco duro.
</p></li>
</ul>


<p>
Los procesos necesitan tiempo de uso de procesador, y todo proceso
pasa por el porcesador.
</p>

<p>
Sin embargo no todo proceso pasa por la RAM, sino puede utilizar
alguna otra de las memorias principales.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf40d796" class="outline-3">
<h3 id="orgf40d796">Clase 10</h3>
<div class="outline-text-3" id="text-orgf40d796">
</div>
<div id="outline-container-org3deefe6" class="outline-4">
<h4 id="org3deefe6">Ciclo de instrucciones del CPU</h4>
<div class="outline-text-4" id="text-org3deefe6">
</div>
<ul class="org-ul">
<li><a id="org5714a63"></a>Fetch<br />
<div class="outline-text-5" id="text-org5714a63">
<p>
Éste consiste en obtener o buscar las instrucciones.
</p>
</div>
</li>

<li><a id="org179b863"></a>Decode<br />
<div class="outline-text-5" id="text-org179b863">
<p>
Ver de qué trata la instrucción.
</p>
</div>
</li>

<li><a id="org8c7e767"></a>Execute<br />
<div class="outline-text-5" id="text-org8c7e767">
<p>
Ejecutar la instrucción.
</p>
</div>
</li>

<li><a id="org7ac84aa"></a>Write<br />
<div class="outline-text-5" id="text-org7ac84aa">
<p>
En caso de ser necesario para el proceso.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org0651c76" class="outline-4">
<h4 id="org0651c76">Interrupciones</h4>
<div class="outline-text-4" id="text-org0651c76">
<p>
El proceso de interrupciones del sistema consiste en detener una
tarea para realizar otra con mayor importancia o interrumpir por
conveniencia del sistema.
</p>

<p>
Por lo general son impulsos/señales eléctricas.
</p>

<p>
El proceso de interrupciones consta de los siguientes pasos:
</p>

<ol class="org-ol">
<li>El hardware/software tiene un proceso llamado "solicitud de
interrupción" en el que la CPU detecta después de ejecutar una
instrucción.</li>

<li><p>
Sí hay una interrupción, la CPU detecta que un "controlador de
dispositivo" a firmado una solicitud de interrupción lee el
número de interrupción, "salta" a la interrupción misma y traza
un "vector de interrupción".
</p>

<p>
El vector de interrupción consta de información importante;
hacia dónde va la interrupción, de dónde viene y una copia del
estado del proceso.
</p></li>
</ol>


<p>
En Sistemas Operativos modernos se necesitan añadir las siguientes
características para un manejo más sofisticado de las
interrupciones:
</p>

<ol class="org-ol">
<li>Tener la capacidad de diferir el manejo de la interrupción
durante el proceso crítico.</li>

<li>Tener interrupciones <span class="underline">multinivel</span> para que el Sistema Operativo
pueda distinguir entre interrupciones de <span class="underline">alta</span> y <span class="underline">baja</span> prioridad.</li>

<li>Tener una forma eficiente de enviar una interrupción adecuada
para cada dispositivo.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9f16844" class="outline-3">
<h3 id="org9f16844">Clase 11</h3>
<div class="outline-text-3" id="text-org9f16844">
</div>
<div id="outline-container-orgdb47ed9" class="outline-4">
<h4 id="orgdb47ed9">Capas del kérnel</h4>
<div class="outline-text-4" id="text-orgdb47ed9">
</div>
<ul class="org-ul">
<li><a id="org234886a"></a>Núcleo<br />
<div class="outline-text-5" id="text-org234886a">
<p>
Permite que los procesos existan como entidades calendarizables.
</p>

<p>
En éste núcleo se pueden ejecutar instrucciones privilegiadas.
</p>
</div>
</li>

<li><a id="org494e165"></a>Memoria<br />
<div class="outline-text-5" id="text-org494e165">
<p>
Permite asignar memoria dinámica a los procesos.
</p>
</div>
</li>
