content/notas/SO/Notas.org
**** Entrada / Salida

     Da una arquitectura coherente para hacer operaciones de Entrada /
     Salida.

**** Archivos

     Almacenamiento persistente y administración del almacenamiento
     secundario.

*** Jerarquía de los dispositivos de alacenamiento

    1. Registros
    2. Caché
    3. Memoria principal
    4. Discos electrónico
    5. Discos magnéticos
    6. Discos ópticas
    7. Cintas magnéticas

*** Sistemas Operativos de fuente abierta

    - Los sistemas operativos que se ofrecen en forma de código fuente
      en lugar de simplemente código binario de *fuente cerrada*.

    - Para contrarrestas el movimiento de protección de copia y la
      administración de derechos digital.

    - Comenzando por la Free Software Foundation, la cual tiene
      izquierdos de copia.

    - Ejemplos incluyen GNU/Linux, Solaris, BSD, entre otros.

** Clase 12
*** Proceso

    - Unidad de trabajo del sistema

      - Un proceso por actividad

	- Ejms:

	  - Procesos de sistema:

	    - Calentarización

	    - E/S

	    - Sistema de archivos

	  - Procesos de usuario

	    - Navegador web

	    - Editor de textos


    - Dinámico
      
      - Su estado va cambiando

    - Corresponde a la ejecución de uno o más programas/rutinas


    - Dinámico
      
      - Recursos asociados

	- Identificador de procesaso (PID)

	- Memoria

	- Archivos

	- Sockets: Son el mecanismo con el que se puede tener
          comunicación en red.

	- Apuntador de instrucción actual

      - Administrados por el Sistema Operativo

	- En tiempo de creación

	- En tiempo de ejecución
** Clase 13
*** Glosario

    - Procesador: Un chip físico que ejecuta las funciones de un CPU
    - Core: La unidad de cálculo básico del CPU.
    - Multicore: Incluye múltiples núcleos de computación en la misma CPU.
    - Multiprocesador: Que incluye múltiples procesadores en la CPU.
      
**** CPU con procesador único

     CPU la cual contiene un sólo procesador; un sólo core que ejecuta
     todas las funciones.

***** Programación Secuencial

      Se puede hacer computación Paralela/Concurrente/Distribuida,
      pero no es lo idóneo

      Sus ventajas es que es más simple de programar y fiable, pero
      los procesos se ejecutan más lentos.

**** CPU con multiprocesadores

     El incremento de la velocidad de un programa utilizando mútiples
     procesadores. En computación concurrente está limitado por la
     fracción secuencial del programa.

     En un sistema distribuido (clusters), la memoria no es compartida
     y no están físicamente en el mismo lugar.

     En el cómputo concurrente, la memoria es compartida pues se
     utiliza la misma computadora.

     En el cómputo paralelo, de igual maner se comparte memoria pues
     utilizan el mismo CPU

** Clase 14
*** Programa / rutina

    - Conjunto de instrucciones y datos que desciben los pasos de una
      tarea
      
      - Ordenar arreglos: =qsort(libc)=

      - Limpiar pantalla: =/bin/clear=

      - Editor: =C:\\Windows\Noteád.exe=

    - Estático

    - En lenguaje de máquina
      
*** Procesador

    - Agente que ejecuta las instrucciones de un programa, para poder
      llevar a cabo un proceso

      - El proceso "corre" en el procesador

      - El procesador "corre" el proceso

    - El programa asociado a un proceso no necesarimente enstá en el
      Software

      - Ejemplo: Rutinas de un controlador USB (firmware)

	- Un procesador capaz de ejecutar un sólo tipo de proceso

*** Aplicación

    - Una aplicación sofisticada consiste de varios procesos.

      - Una hoja de cálculo.

*** Concurrencia y no-determinismo

    - Activación de varios procesos al mismo tiempo

**** Concurrencia aparente

     - #procesos > #procesadores

       - Los procesos alternan entre procesos

       - Ilusión de concurrencia real

***** Analogía

      - Un secretario realiza múltiples tareas

	- Escribir documentos

	- Capturar dictado

	- Preparar café

	- Contestar teléfonos

*** No determinismo

    - Impredicibilidad de:

      - Instrucción en la que se interrumpe un proceso.

	- Orden relativo de ejecución de instrucciones de procesos
          diferentes.

      - Tiempo que tomará una operaciónde Entrada / Salida

	- Orden / Tiempo de interrupciones

      - Solicitud de recursos de un proceso

	- Archivos / Sockets / Memoria / ...

      - Interrupción / intercambio de procesos

	- Debemos recordar el punto y el estado en el que está para
          poder regresar después a su ejecución.

** Clase 15
*** Los procesos

    - Cooperan, compiten por recursos
      
    - Áreas en la que la sincronización/CIP es esencial:
      
      - Exclusión mutua
	
      - Sincronización
	
      - Prevención de Deadlocks
	
**** Exclusión mutua

     - Hay recursos que no pueden usarse por dos procesos al mismo tiempo

       - Impresora

       - Localidades de memoria


     El problema es asegurar que un sólo procesos tiene acceso a
     cierto recurso en un momento dado.

**** Agentes de reseva de boleto

     - Agente A observa si el asiento 5 está disponible, y pregunta a
       su cliente.
       
     - Agente B observa si el asiento 5 está disponible, y pregunta a
       su cliente.

     - Agente A reserva el asiento 5.

     - Agente B reserva el asiento 5.

**** Sincronización

     - La velocidad relatica de procesos es impredecible
       
       - Depende de la frecuencia con que son interrumpidos.
	 
	 - $\Rightarrow$ Los procesos son _asíncronos_.
	   
     - Algunos prosesos se deben _sincronizar_
       
     - Productores / Consumidores

**** Deadlock

     - Situación en que un grupo de procesos se bloquea

       - Un proceso ocupa un recurso que el otro necesita para
         continuar.

     - (/Filósofos cenando/)

