notas/SO/Notas.html

<li><a id="org4b03df8"></a>Entrada / Salida<br />
<div class="outline-text-5" id="text-org4b03df8">
<p>
Da una arquitectura coherente para hacer operaciones de Entrada /
Salida.
</p>
</div>
</li>

<li><a id="org37a9e22"></a>Archivos<br />
<div class="outline-text-5" id="text-org37a9e22">
<p>
Almacenamiento persistente y administración del almacenamiento
secundario.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orge573446" class="outline-4">
<h4 id="orge573446">Jerarquía de los dispositivos de alacenamiento</h4>
<div class="outline-text-4" id="text-orge573446">
<ol class="org-ol">
<li>Registros</li>
<li>Caché</li>
<li>Memoria principal</li>
<li>Discos electrónico</li>
<li>Discos magnéticos</li>
<li>Discos ópticas</li>
<li>Cintas magnéticas</li>
</ol>
</div>
</div>

<div id="outline-container-orgbb47062" class="outline-4">
<h4 id="orgbb47062">Sistemas Operativos de fuente abierta</h4>
<div class="outline-text-4" id="text-orgbb47062">
<ul class="org-ul">
<li>Los sistemas operativos que se ofrecen en forma de código fuente
en lugar de simplemente código binario de <b>fuente cerrada</b>.</li>

<li>Para contrarrestas el movimiento de protección de copia y la
administración de derechos digital.</li>

<li>Comenzando por la Free Software Foundation, la cual tiene
izquierdos de copia.</li>

<li>Ejemplos incluyen GNU/Linux, Solaris, BSD, entre otros.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9ff1506" class="outline-3">
<h3 id="org9ff1506">Clase 12</h3>
<div class="outline-text-3" id="text-org9ff1506">
</div>
<div id="outline-container-orgfb8a083" class="outline-4">
<h4 id="orgfb8a083">Proceso</h4>
<div class="outline-text-4" id="text-orgfb8a083">
<ul class="org-ul">
<li>Unidad de trabajo del sistema

<ul class="org-ul">
<li>Un proceso por actividad

<ul class="org-ul">
<li>Ejms:

<ul class="org-ul">
<li>Procesos de sistema:

<ul class="org-ul">
<li>Calentarización</li>

<li>E/S</li>

<li>Sistema de archivos</li>
</ul></li>

<li>Procesos de usuario

<ul class="org-ul">
<li>Navegador web</li>

<li>Editor de textos</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul>


<ul class="org-ul">
<li>Dinámico

<ul class="org-ul">
<li>Su estado va cambiando</li>
</ul></li>

<li>Corresponde a la ejecución de uno o más programas/rutinas</li>
</ul>


<ul class="org-ul">
<li>Dinámico

<ul class="org-ul">
<li>Recursos asociados

<ul class="org-ul">
<li>Identificador de procesaso (PID)</li>

<li>Memoria</li>

<li>Archivos</li>

<li>Sockets: Son el mecanismo con el que se puede tener
comunicación en red.</li>

<li>Apuntador de instrucción actual</li>
</ul></li>

<li>Administrados por el Sistema Operativo

<ul class="org-ul">
<li>En tiempo de creación</li>

<li>En tiempo de ejecución</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org21e2320" class="outline-3">
<h3 id="org21e2320">Clase 13</h3>
<div class="outline-text-3" id="text-org21e2320">
</div>
<div id="outline-container-org18f9609" class="outline-4">
<h4 id="org18f9609">Glosario</h4>
<div class="outline-text-4" id="text-org18f9609">
<ul class="org-ul">
<li>Procesador: Un chip físico que ejecuta las funciones de un CPU</li>
<li>Core: La unidad de cálculo básico del CPU.</li>
<li>Multicore: Incluye múltiples núcleos de computación en la misma CPU.</li>
<li>Multiprocesador: Que incluye múltiples procesadores en la CPU.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgcdfeeb7"></a>CPU con procesador único<br />
<div class="outline-text-5" id="text-orgcdfeeb7">
<p>
CPU la cual contiene un sólo procesador; un sólo core que ejecuta
todas las funciones.
</p>
</div>

<ul class="org-ul">
<li><a id="orgcf7f93c"></a>Programación Secuencial<br />
<div class="outline-text-6" id="text-orgcf7f93c">
<p>
Se puede hacer computación Paralela/Concurrente/Distribuida,
pero no es lo idóneo
</p>

<p>
Sus ventajas es que es más simple de programar y fiable, pero
los procesos se ejecutan más lentos.
</p>
</div>
</li>
</ul>
</li>

<li><a id="org5bfccf8"></a>CPU con multiprocesadores<br />
<div class="outline-text-5" id="text-org5bfccf8">
<p>
El incremento de la velocidad de un programa utilizando mútiples
procesadores. En computación concurrente está limitado por la
fracción secuencial del programa.
</p>

<p>
En un sistema distribuido (clusters), la memoria no es compartida
y no están físicamente en el mismo lugar.
</p>

<p>
En el cómputo concurrente, la memoria es compartida pues se
utiliza la misma computadora.
</p>

<p>
En el cómputo paralelo, de igual maner se comparte memoria pues
utilizan el mismo CPU
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga0ee863" class="outline-3">
<h3 id="orga0ee863">Clase 14</h3>
<div class="outline-text-3" id="text-orga0ee863">
</div>
<div id="outline-container-org962cf79" class="outline-4">
<h4 id="org962cf79">Programa / rutina</h4>
<div class="outline-text-4" id="text-org962cf79">
<ul class="org-ul">
<li>Conjunto de instrucciones y datos que desciben los pasos de una
tarea

<ul class="org-ul">
<li>Ordenar arreglos: <code>qsort(libc)</code></li>

<li>Limpiar pantalla: <code>/bin/clear</code></li>

<li>Editor: <code>C:\\Windows\Noteád.exe</code></li>
</ul></li>

<li>Estático</li>

<li>En lenguaje de máquina</li>
</ul>
</div>
</div>

<div id="outline-container-orgb42c496" class="outline-4">
<h4 id="orgb42c496">Procesador</h4>
<div class="outline-text-4" id="text-orgb42c496">
<ul class="org-ul">
<li>Agente que ejecuta las instrucciones de un programa, para poder
llevar a cabo un proceso

<ul class="org-ul">
<li>El proceso "corre" en el procesador</li>

<li>El procesador "corre" el proceso</li>
</ul></li>

<li>El programa asociado a un proceso no necesarimente enstá en el
Software

<ul class="org-ul">
<li>Ejemplo: Rutinas de un controlador USB (firmware)

<ul class="org-ul">
<li>Un procesador capaz de ejecutar un sólo tipo de proceso</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgdc6d227" class="outline-4">
<h4 id="orgdc6d227">Aplicación</h4>
<div class="outline-text-4" id="text-orgdc6d227">
<ul class="org-ul">
<li>Una aplicación sofisticada consiste de varios procesos.

<ul class="org-ul">
<li>Una hoja de cálculo.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0267f5c" class="outline-4">
<h4 id="org0267f5c">Concurrencia y no-determinismo</h4>
<div class="outline-text-4" id="text-org0267f5c">
<ul class="org-ul">
<li>Activación de varios procesos al mismo tiempo</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgdfce214"></a>Concurrencia aparente<br />
<div class="outline-text-5" id="text-orgdfce214">
<ul class="org-ul">
<li>#procesos &gt; #procesadores

<ul class="org-ul">
<li>Los procesos alternan entre procesos</li>

<li>Ilusión de concurrencia real</li>
</ul></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orga321438"></a>Analogía<br />
<div class="outline-text-6" id="text-orga321438">
<ul class="org-ul">
<li>Un secretario realiza múltiples tareas

<ul class="org-ul">
<li>Escribir documentos</li>

<li>Capturar dictado</li>

<li>Preparar café</li>

<li>Contestar teléfonos</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org59876a0" class="outline-4">
<h4 id="org59876a0">No determinismo</h4>
<div class="outline-text-4" id="text-org59876a0">
<ul class="org-ul">
<li>Impredicibilidad de:

<ul class="org-ul">
<li>Instrucción en la que se interrumpe un proceso.

<ul class="org-ul">
<li>Orden relativo de ejecución de instrucciones de procesos
diferentes.</li>
</ul></li>

<li>Tiempo que tomará una operaciónde Entrada / Salida

<ul class="org-ul">
<li>Orden / Tiempo de interrupciones</li>
</ul></li>

<li>Solicitud de recursos de un proceso

<ul class="org-ul">
<li>Archivos / Sockets / Memoria / &#x2026;</li>
</ul></li>

<li>Interrupción / intercambio de procesos

<ul class="org-ul">
<li>Debemos recordar el punto y el estado en el que está para
poder regresar después a su ejecución.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc6be16a" class="outline-3">
<h3 id="orgc6be16a">Clase 15</h3>
<div class="outline-text-3" id="text-orgc6be16a">
</div>
<div id="outline-container-orgccfe495" class="outline-4">
<h4 id="orgccfe495">Los procesos</h4>
<div class="outline-text-4" id="text-orgccfe495">
<ul class="org-ul">
<li>Cooperan, compiten por recursos</li>

<li>Áreas en la que la sincronización/CIP es esencial:

<ul class="org-ul">
<li>Exclusión mutua</li>

<li>Sincronización</li>

<li>Prevención de Deadlocks</li>
</ul></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orge0bdd0a"></a>Exclusión mutua<br />
<div class="outline-text-5" id="text-orge0bdd0a">
<ul class="org-ul">
<li>Hay recursos que no pueden usarse por dos procesos al mismo tiempo

<ul class="org-ul">
<li>Impresora</li>

<li>Localidades de memoria</li>
</ul></li>
</ul>


<p>
El problema es asegurar que un sólo procesos tiene acceso a
cierto recurso en un momento dado.
</p>
</div>
</li>

<li><a id="org4f6708c"></a>Agentes de reseva de boleto<br />
<div class="outline-text-5" id="text-org4f6708c">
<ul class="org-ul">
<li>Agente A observa si el asiento 5 está disponible, y pregunta a
su cliente.</li>

<li>Agente B observa si el asiento 5 está disponible, y pregunta a
su cliente.</li>

<li>Agente A reserva el asiento 5.</li>

<li>Agente B reserva el asiento 5.</li>
</ul>
</div>
</li>

<li><a id="orgff5bb7c"></a>Sincronización<br />
<div class="outline-text-5" id="text-orgff5bb7c">
<ul class="org-ul">
<li>La velocidad relatica de procesos es impredecible

<ul class="org-ul">
<li>Depende de la frecuencia con que son interrumpidos.

<ul class="org-ul">
<li>\(\Rightarrow\) Los procesos son <span class="underline">asíncronos</span>.</li>
</ul></li>
</ul></li>

<li>Algunos prosesos se deben <span class="underline">sincronizar</span></li>

<li>Productores / Consumidores</li>
</ul>
</div>
</li>

<li><a id="org2b33591"></a>Deadlock<br />
<div class="outline-text-5" id="text-org2b33591">
<ul class="org-ul">
<li>Situación en que un grupo de procesos se bloquea

<ul class="org-ul">
<li>Un proceso ocupa un recurso que el otro necesita para
continuar.</li>
</ul></li>

<li>(<i>Filósofos cenando</i>)</li>
</ul>
</div>
</li>
</ul>
</div>
