content/notas/SO/Notas.org
*** Semáforos

    Fueron inventados por Dijkstra en 1965

    - Un semáforo es una variable enteera que se manipula con sólo dos
      operaciones *indivisibles*.
      
      - wait(sem) (/down/)
 
      - signal(sem) (/up/)

    - Tan pronto puede, decrementa el semáforo en exactamente una
      unidad.

    - Incrementa el semáforo en exáctamente un unidad.

** Clase 16
*** wait(sem)

    Existe un retraso potencial cuando =sem= es 0.

    No hay retraso si =sem= es mayor a 0.

    Potencial costo: cambio de contexto.

    Sólo se puede contirunar cuando algún =signal()= hace que =sem= sea
    disnto a 0.

    Un sólo proceso podrá continuar, pero no sabemos cual.
    
*** Invariante

    Cada =signal()= incrementa el semáforo.

    Cada =wait()= completada, decrementa el semáforo.

    =val(sem)==inicial(sem)+signals(sem)-waits(sem)=

*** Exclusión mutua

    - El problema es asegurar que un solo proceso tiene acceso a
      cierto recurso en un momento dado.

      - una solución sería utilizar un semáforo por recurso.

	- El valor inicial del semáforo es 1.
	
	- =wait(sem_recurso)=

	- uso de recurso

	- =signal(sem_recurso)=

** Laboratorio 5
*** thread.c

    Insertar de manera ordenada por medio de una función compare.
    
    #+begin_src c
void thread_create(args){
  //...
  thread_unblock(t);
  
  if (thread_current()->priority < t->priority){
    thread_yield();
  }
  //...
}


void thread_set_priority(int new_priority){
  if (new_priority < thread_current()){
    //...
  }
}

// o

void thread_unblock(struct thread* t){
  //list_push_back(...)
  list_insert_ordered(...,compare,...);
  //...
  if(thread_current()->priority < t->priority){
    if (!intr_context()){
      thread_yield();
    }else{
      intr_yield_on_return();
    }
  }
}

//extra

next_thread_to_run(){
  //Modificar para acceder a la posición en el arreglo con la
  //prioridad más alta.
}
    #+end_src
    
*** synch.c

    #+begin_src c
void sema_up(struct*){
  //...
  sema->value++;
  if (!list_empty(...)){
    ...
  }
  //...
}
    #+end_src

** Clase 17
*** Sincronización

    EL proceso B puede pasar por L2 sólo si A ya pasó por L1.
    
*** Productores/Consumidor

    - Los productores producen elementos indefinidamente.

    - Los consumidores los utilizan

      - Se usa un buffer con capacidad finita para depositar/extraer los elementos

      - Regulación bidireccional

    - Ejemplos:

      - Serivdor de impresión

      - Transferencias por red (ssh/ youtube)

      - Servidor de ventanas/aplicación gráficas (eventos GUI)

      - Tuberías de Unix

      - Drivers (Entrada: productores / Salida: consumidores)

** Clase 18
*** Solución Productores/consumidores

    Productores
    
    #+begin_src prog
while true do
      produce item;
      wait(espacio_discponible);
      wait(buffer_manipulable);
      insert item into buffer;
      signal(buffer_manipulable);
      signal(elemento_disponible);
done
    #+end_src

    Consumidores
    
    #+begin_src prog
while true do
      wait(elemento_disponible);
      wait(buffer_manipulable);
      item <- pop buffer;
      signal(buffer_manipulable);
      signal(espacio_disponible);
      consume item;
done
    #+end_src

    Los valores iniciales serían =espacio_disponible:=N= y
    =elemento_disponible:=0=.
** Laboratorio 6
*** thread.c

    Añadir variable =load_avg=0;=

    Todas las operaciones van en la función =thread_tick=

    Incluir =devices/timer.h= (=#include=)

    #+begin_src c
struct thread* t = thread_current();
if (timer_ticks() % TIMER_FREQ == 0){
  int c59_60 = fixpoint(59, 60);
  int c1_60 = fixpoint(1, 60);
  load_avg = c59_60 * load_avg + c1_60 * list_size(&ready_list);
 }
thread_current()->recent_cpu++;
    #+end_src
    
    #+begin_src c
thread_get_nice(void){
  return thread_current()->nice;
}
    #+end_src

    =thread_get_load_avg= y =thread_get_recent_cpu= deben ser editadas.
** Clase 19
*** Servicios del sistema

    - Manejador de archivos: Son los programas que crean, borran,
      renombran e imprimen; en general manipulan archivos y
      directorios.

      - =touch [ruta del archivo]=

      - =mkdir [nombre / ruta del archivo]=

      - =ls [ruta del archivo o directorio]=

      - =rm [ruta de origen] [ruta de destino]=

      - =cp [ruta de origen] [ruta de destino]=

      - =rsync= copia con permiso

    - Información o Estatus: Programas que preguntan al sistema acerca
      del estado mismo.

      - =top=

      - =chmod=

      - =date=

      - =uname=

      - =date=

      - =uptime=

    - Comunicación: Permiten crear comunicación entre procesos.

      - =ssh=

      - =wget=
** Clase 20
