notas/SO/Notas.html

<div id="outline-container-orge983888" class="outline-4">
<h4 id="orge983888">Semáforos</h4>
<div class="outline-text-4" id="text-orge983888">
<p>
Fueron inventados por Dijkstra en 1965
</p>

<ul class="org-ul">
<li>Un semáforo es una variable enteera que se manipula con sólo dos
operaciones <b>indivisibles</b>.

<ul class="org-ul">
<li>wait(sem) (<i>down</i>)</li>

<li>signal(sem) (<i>up</i>)</li>
</ul></li>

<li>Tan pronto puede, decrementa el semáforo en exactamente una
unidad.</li>

<li>Incrementa el semáforo en exáctamente un unidad.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0aef197" class="outline-3">
<h3 id="org0aef197">Clase 16</h3>
<div class="outline-text-3" id="text-org0aef197">
</div>
<div id="outline-container-org15740be" class="outline-4">
<h4 id="org15740be">wait(sem)</h4>
<div class="outline-text-4" id="text-org15740be">
<p>
Existe un retraso potencial cuando <code>sem</code> es 0.
</p>

<p>
No hay retraso si <code>sem</code> es mayor a 0.
</p>

<p>
Potencial costo: cambio de contexto.
</p>

<p>
Sólo se puede contirunar cuando algún <code>signal()</code> hace que <code>sem</code> sea
disnto a 0.
</p>

<p>
Un sólo proceso podrá continuar, pero no sabemos cual.
</p>
</div>
</div>

<div id="outline-container-org5d892e0" class="outline-4">
<h4 id="org5d892e0">Invariante</h4>
<div class="outline-text-4" id="text-org5d892e0">
<p>
Cada <code>signal()</code> incrementa el semáforo.
</p>

<p>
Cada <code>wait()</code> completada, decrementa el semáforo.
</p>

<p>
<code>val(sem)==inicial(sem)+signals(sem)-waits(sem)</code>
</p>
</div>
</div>

<div id="outline-container-org168d3ee" class="outline-4">
<h4 id="org168d3ee">Exclusión mutua</h4>
<div class="outline-text-4" id="text-org168d3ee">
<ul class="org-ul">
<li>El problema es asegurar que un solo proceso tiene acceso a
cierto recurso en un momento dado.

<ul class="org-ul">
<li>una solución sería utilizar un semáforo por recurso.

<ul class="org-ul">
<li>El valor inicial del semáforo es 1.</li>

<li><code>wait(sem_recurso)</code></li>

<li>uso de recurso</li>

<li><code>signal(sem_recurso)</code></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc85396f" class="outline-3">
<h3 id="orgc85396f">Laboratorio 5</h3>
<div class="outline-text-3" id="text-orgc85396f">
</div>
<div id="outline-container-org0ef07f4" class="outline-4">
<h4 id="org0ef07f4">thread.c</h4>
<div class="outline-text-4" id="text-org0ef07f4">
<p>
Insertar de manera ordenada por medio de una función compare.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">thread_create</span>(args){
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
  thread_unblock(t);

  <span style="font-weight: bold;">if</span> (thread_current()-&gt;priority &lt; t-&gt;priority){
    thread_yield();
  }
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
}


<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">thread_set_priority</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">new_priority</span>){
  <span style="font-weight: bold;">if</span> (new_priority &lt; thread_current()){
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
  }
}

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">o</span>

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">thread_unblock</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>* <span style="font-weight: bold; font-style: italic;">t</span>){
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">list_push_back(...)</span>
  list_insert_ordered(...,compare,...);
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
  <span style="font-weight: bold;">if</span>(thread_current()-&gt;priority &lt; t-&gt;priority){
    <span style="font-weight: bold;">if</span> (!intr_context()){
      thread_yield();
    }<span style="font-weight: bold;">else</span>{
      intr_yield_on_return();
    }
  }
}

<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">extra</span>

<span style="font-weight: bold;">next_thread_to_run</span>(){
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Modificar para acceder a la posici&#243;n en el arreglo con la</span>
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">prioridad m&#225;s alta.</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org349176b" class="outline-4">
<h4 id="org349176b">synch.c</h4>
<div class="outline-text-4" id="text-org349176b">
<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">sema_up</span>(<span style="font-weight: bold;">struct</span>*){
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
  sema-&gt;value++;
  <span style="font-weight: bold;">if</span> (!list_empty(...)){
    ...
  }
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb3c3c33" class="outline-3">
<h3 id="orgb3c3c33">Clase 17</h3>
<div class="outline-text-3" id="text-orgb3c3c33">
</div>
<div id="outline-container-org7d9b896" class="outline-4">
<h4 id="org7d9b896">Sincronización</h4>
<div class="outline-text-4" id="text-org7d9b896">
<p>
EL proceso B puede pasar por L2 sólo si A ya pasó por L1.
</p>
</div>
</div>

<div id="outline-container-org63f9350" class="outline-4">
<h4 id="org63f9350">Productores/Consumidor</h4>
<div class="outline-text-4" id="text-org63f9350">
<ul class="org-ul">
<li>Los productores producen elementos indefinidamente.</li>

<li>Los consumidores los utilizan

<ul class="org-ul">
<li>Se usa un buffer con capacidad finita para depositar/extraer los elementos</li>

<li>Regulación bidireccional</li>
</ul></li>

<li>Ejemplos:

<ul class="org-ul">
<li>Serivdor de impresión</li>

<li>Transferencias por red (ssh/ youtube)</li>

<li>Servidor de ventanas/aplicación gráficas (eventos GUI)</li>

<li>Tuberías de Unix</li>

<li>Drivers (Entrada: productores / Salida: consumidores)</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7a41592" class="outline-3">
<h3 id="org7a41592">Clase 18</h3>
<div class="outline-text-3" id="text-org7a41592">
</div>
<div id="outline-container-orgbc90d9e" class="outline-4">
<h4 id="orgbc90d9e">Solución Productores/consumidores</h4>
<div class="outline-text-4" id="text-orgbc90d9e">
<p>
Productores
</p>

<div class="org-src-container">
<pre class="src src-prog">while true do
      produce item;
      wait(espacio_discponible);
      wait(buffer_manipulable);
      insert item into buffer;
      signal(buffer_manipulable);
      signal(elemento_disponible);
done
</pre>
</div>

<p>
Consumidores
</p>

<div class="org-src-container">
<pre class="src src-prog">while true do
      wait(elemento_disponible);
      wait(buffer_manipulable);
      item &lt;- pop buffer;
      signal(buffer_manipulable);
      signal(espacio_disponible);
      consume item;
done
</pre>
</div>

<p>
Los valores iniciales serían <code>espacio_disponible:=N</code> y
<code>elemento_disponible:=0</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org7b225d3" class="outline-3">
<h3 id="org7b225d3">Laboratorio 6</h3>
<div class="outline-text-3" id="text-org7b225d3">
</div>
<div id="outline-container-org9c8b31a" class="outline-4">
<h4 id="org9c8b31a">thread.c</h4>
<div class="outline-text-4" id="text-org9c8b31a">
<p>
Añadir variable <code>load_avg=0;</code>
</p>

<p>
Todas las operaciones van en la función <code>thread_tick</code>
</p>

<p>
Incluir <code>devices/timer.h</code> (<code>#include</code>)
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>* <span style="font-weight: bold; font-style: italic;">t</span> = thread_current();
<span style="font-weight: bold;">if</span> (timer_ticks() % TIMER_FREQ == 0){
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">c59_60</span> = fixpoint(59, 60);
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">c1_60</span> = fixpoint(1, 60);
  load_avg = c59_60 * load_avg + c1_60 * list_size(&amp;ready_list);
 }
<span style="font-weight: bold;">thread_current</span>()-&gt;recent_cpu++;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">thread_get_nice</span>(<span style="font-weight: bold; text-decoration: underline;">void</span>){
  <span style="font-weight: bold;">return</span> thread_current()-&gt;nice;
}
</pre>
</div>

<p>
<code>thread_get_load_avg</code> y <code>thread_get_recent_cpu</code> deben ser editadas.
</p>
</div>
</div>
</div>
<div id="outline-container-orgcbf556f" class="outline-3">
<h3 id="orgcbf556f">Clase 19</h3>
<div class="outline-text-3" id="text-orgcbf556f">
</div>
<div id="outline-container-org794a12c" class="outline-4">
<h4 id="org794a12c">Servicios del sistema</h4>
<div class="outline-text-4" id="text-org794a12c">
<ul class="org-ul">
<li>Manejador de archivos: Son los programas que crean, borran,
renombran e imprimen; en general manipulan archivos y
directorios.

<ul class="org-ul">
<li><code>touch [ruta del archivo]</code></li>

<li><code>mkdir [nombre / ruta del archivo]</code></li>

<li><code>ls [ruta del archivo o directorio]</code></li>

<li><code>rm [ruta de origen] [ruta de destino]</code></li>

<li><code>cp [ruta de origen] [ruta de destino]</code></li>

<li><code>rsync</code> copia con permiso</li>
</ul></li>

<li>Información o Estatus: Programas que preguntan al sistema acerca
del estado mismo.

<ul class="org-ul">
<li><code>top</code></li>

<li><code>chmod</code></li>

<li><code>date</code></li>

<li><code>uname</code></li>

<li><code>date</code></li>

<li><code>uptime</code></li>
</ul></li>

<li>Comunicación: Permiten crear comunicación entre procesos.

<ul class="org-ul">
<li><code>ssh</code></li>

<li><code>wget</code></li>
</ul></li>
</ul>
</div>
</div>
</div>
