content/notas/SO/Notas.org
*** MLFQ

    - Conceptos básicos

      - Ráfagas de CPU en procesos interactivos

      - Calendarizador

	- Non-preemptive

	- Preemptive

	- Parámetros a optimizar

      - Despachador

      - Ejemplos de:

	- First Come, First Served

	- Shorted Job first

	  - Estimación de longitud de ráfagas de CPU

	- Prioridades; con colas multinivel

	  - Hambruna
** Laboratiorio 7
*** ¿Por qué no podemos usar floats?

    Es posible usarlos en un entorno de kérnel, sin embargo es más
    costoso usarlos pues hay que estar pendiente también del uso de
    los registros que se utilizan al operar con numeros con punto
    flotante.
** Clase 21
*** Manejador de interrupciones de primer nivel


    Su labor es responder a las interrucpciones, con mayor o menor ayda del HW

    Se ejecuta con interrupciones deshabilitadas.

    - Determina la fuente

    - Procesa la interrupción: ejcuta una rutina de servicio de
      interrupción asociada.


    Puede hacer parcialmente el trabajo para el manejador de
    interrupciones de segundo nivel.

    Puede alterar el estado de los procesos.

    La parte del núcleo encargado de responder a las señales.

    - Externas

    - Internas: Llamadas al sistema por medio de software.


    Realiza dos principales tareas

    - Determinar la fuente

    - Inicial el servicio de interrupción


    Se ejecuta en modo supervisor

    Se asegura que los datos que podría reescribir del procesos
    interrumpido sean guardados.

    - El /FLIH/ debe ser muy simple: tal vez no haya que guardar todo el
      contexto.
      
**** Determinar la fuente de la interrupción

     Puede ser más o menos fácil, dependiendo del soporte del HW.

     - Sin soporte: cadena de omisiones (/skip chain/), la rutina de
       servicio de interrupción encuesta a los dispositivos asociados
       a un mismo canal de interrupción revisando su estado antes de
       ejecutar su respectiva rutina de servicio de interrupción.

       Hay que probar las potenciales fuentes de la ibterrupción,
       hasta enconstrarla.

     - Con soporte: Dependiendo de la fuente, el rpcesador brinca a
       una dirección de memoria diferente.

       - Una combinación de ambas (por ejemplo, en Linux)


     La interrupciones se deshabilitan cuando se transfiere control al
     /FLIH/.

     - Totalmente: Se deshabilitan todas las interrupciones.

     - Parcialmente: Se enmascaran las de prioridades menores o igual.


     Se rehabilitan al salir del /FLIH/

**** Iniciar el servicio de la interrupción

     Se llama a la rutina adecuada.

     - Como se ejecuta en modo supervisor, y con interrupciones
       enmascaradas, la rutina debe ser lo más pequeña posible.

     - Se debe hacer lo mínimo posible y después se puede acabar de
       procesar la interrupción.

     - Ejemplo: /FLIH/ de teclado:

       - Copia el dato de entrada a un buffer.

       - Un proceso normal se encarga de transferirlo al proceso
         indicado, después.

**** Interrupciones y cambio de estado de procesos

     Generalmente una interrupción altera el estado de algunos procesos.

     - La conlcusión de una transferencia puede hacer ejecutable al
       proceso que habí sido supendido al solicitarla.

     - Una llamada al sistema wait() sobre un semáforo nulo, cambia el
       estado del proceso que se está ejecuntando a no-ejecutable.


     Como consecuencia, tal vez sea mejor cambiar de proceso
     actual. Cede el control al despachador.

** Laboratiorio 8

