notas/SO/Notas.html
<div id="outline-container-org0c06a47" class="outline-3">
<h3 id="org0c06a47">Clase 20</h3>
<div class="outline-text-3" id="text-org0c06a47">
</div>
<div id="outline-container-org7d67a7d" class="outline-4">
<h4 id="org7d67a7d">MLFQ</h4>
<div class="outline-text-4" id="text-org7d67a7d">
<ul class="org-ul">
<li>Conceptos básicos

<ul class="org-ul">
<li>Ráfagas de CPU en procesos interactivos</li>

<li>Calendarizador

<ul class="org-ul">
<li>Non-preemptive</li>

<li>Preemptive</li>

<li>Parámetros a optimizar</li>
</ul></li>

<li>Despachador</li>

<li>Ejemplos de:

<ul class="org-ul">
<li>First Come, First Served</li>

<li>Shorted Job first

<ul class="org-ul">
<li>Estimación de longitud de ráfagas de CPU</li>
</ul></li>

<li>Prioridades; con colas multinivel

<ul class="org-ul">
<li>Hambruna</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2fe9513" class="outline-3">
<h3 id="org2fe9513">Laboratiorio 7</h3>
<div class="outline-text-3" id="text-org2fe9513">
</div>
<div id="outline-container-org0b70d51" class="outline-4">
<h4 id="org0b70d51">¿Por qué no podemos usar floats?</h4>
<div class="outline-text-4" id="text-org0b70d51">
<p>
Es posible usarlos en un entorno de kérnel, sin embargo es más
costoso usarlos pues hay que estar pendiente también del uso de
los registros que se utilizan al operar con numeros con punto
flotante.
</p>
</div>
</div>
</div>
<div id="outline-container-org54c677d" class="outline-3">
<h3 id="org54c677d">Clase 21</h3>
<div class="outline-text-3" id="text-org54c677d">
</div>
<div id="outline-container-orgb87215b" class="outline-4">
<h4 id="orgb87215b">Manejador de interrupciones de primer nivel</h4>
<div class="outline-text-4" id="text-orgb87215b">
<p>
Su labor es responder a las interrucpciones, con mayor o menor ayda del HW
</p>

<p>
Se ejecuta con interrupciones deshabilitadas.
</p>

<ul class="org-ul">
<li>Determina la fuente</li>

<li>Procesa la interrupción: ejcuta una rutina de servicio de
interrupción asociada.</li>
</ul>


<p>
Puede hacer parcialmente el trabajo para el manejador de
interrupciones de segundo nivel.
</p>

<p>
Puede alterar el estado de los procesos.
</p>

<p>
La parte del núcleo encargado de responder a las señales.
</p>

<ul class="org-ul">
<li>Externas</li>

<li>Internas: Llamadas al sistema por medio de software.</li>
</ul>


<p>
Realiza dos principales tareas
</p>

<ul class="org-ul">
<li>Determinar la fuente</li>

<li>Inicial el servicio de interrupción</li>
</ul>


<p>
Se ejecuta en modo supervisor
</p>

<p>
Se asegura que los datos que podría reescribir del procesos
interrumpido sean guardados.
</p>

<ul class="org-ul">
<li>El <i>FLIH</i> debe ser muy simple: tal vez no haya que guardar todo el
contexto.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org02a6a3f"></a>Determinar la fuente de la interrupción<br />
<div class="outline-text-5" id="text-org02a6a3f">
<p>
Puede ser más o menos fácil, dependiendo del soporte del HW.
</p>

<ul class="org-ul">
<li><p>
Sin soporte: cadena de omisiones (<i>skip chain</i>), la rutina de
servicio de interrupción encuesta a los dispositivos asociados
a un mismo canal de interrupción revisando su estado antes de
ejecutar su respectiva rutina de servicio de interrupción.
</p>

<p>
Hay que probar las potenciales fuentes de la ibterrupción,
hasta enconstrarla.
</p></li>

<li>Con soporte: Dependiendo de la fuente, el rpcesador brinca a
una dirección de memoria diferente.

<ul class="org-ul">
<li>Una combinación de ambas (por ejemplo, en Linux)</li>
</ul></li>
</ul>


<p>
La interrupciones se deshabilitan cuando se transfiere control al
<i>FLIH</i>.
</p>

<ul class="org-ul">
<li>Totalmente: Se deshabilitan todas las interrupciones.</li>

<li>Parcialmente: Se enmascaran las de prioridades menores o igual.</li>
</ul>


<p>
Se rehabilitan al salir del <i>FLIH</i>
</p>
</div>
</li>

<li><a id="orgb75855f"></a>Iniciar el servicio de la interrupción<br />
<div class="outline-text-5" id="text-orgb75855f">
<p>
Se llama a la rutina adecuada.
</p>

<ul class="org-ul">
<li>Como se ejecuta en modo supervisor, y con interrupciones
enmascaradas, la rutina debe ser lo más pequeña posible.</li>

<li>Se debe hacer lo mínimo posible y después se puede acabar de
procesar la interrupción.</li>

<li>Ejemplo: <i>FLIH</i> de teclado:

<ul class="org-ul">
<li>Copia el dato de entrada a un buffer.</li>

<li>Un proceso normal se encarga de transferirlo al proceso
indicado, después.</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="orga5aa96c"></a>Interrupciones y cambio de estado de procesos<br />
<div class="outline-text-5" id="text-orga5aa96c">
<p>
Generalmente una interrupción altera el estado de algunos procesos.
</p>

<ul class="org-ul">
<li>La conlcusión de una transferencia puede hacer ejecutable al
proceso que habí sido supendido al solicitarla.</li>

<li>Una llamada al sistema wait() sobre un semáforo nulo, cambia el
estado del proceso que se está ejecuntando a no-ejecutable.</li>
</ul>


<p>
Como consecuencia, tal vez sea mejor cambiar de proceso
actual. Cede el control al despachador.
</p>
</div>
</li>
</ul>
</div>
</div>
