content/notas/SO/Notas.org
*** Práctica 4: Sincronización

    Utilizar como base la práctica 2.

    Si queremos usar un dispositivo externo, un ejemplo (mal hecho)
    sería el siguiente:
    
    #+begin_src c
int device_init = 0;

void do_something(){
  if (device_init == 0){
    device_init = 1;
    init_device();
  }
  use_device();
}
    #+end_src

    Es incorrecto pues con procesos concurrente puede ocurrir que dos
    o procesos entren al mimso tiempo en la comparación y ambos sea
    correcto pues su valor está en 0 y por tanto el dispositivo se
    inicializaría más de una vez.

    Una solución correcta sería utilizar semáforos

    El semáforo utiliza un while, pues otro hilo al hacer sema_up,
    puede cambiar el valor del semáforo y el primer thread no volvería
    a revisar su valor, y por tanto dos hilos podrían entrar a la
    sección crítica.
    
    En multinúcleo apagar las interrupciones usando semáforos no
    funciona pues se desactivarían sólo las interrupciones de un sólo
    núcleo.

    =thread.h=
    
    #+begin_src c
struct thread{
  //...
  int priority_old;
  //
}
    #+end_src

    =synch.c=

    inicializar old_priority en -1.
    
    #+begin_src c
lock_acquire(struct lock *lock){
  ///...
  struct thread *t = thread_current();
  if (lock->holder != NULL && lock->holder->priority < t->priority){
    lock->old_priority = t->holder->priority;
    lock->holder->priority = t->priority;
    //t->donation = lock
    lock->holder->donation = lock
  }
  sema_down(&lock->semaphore);
  lock->holder = thread_current();
}
    #+end_src

    devolver la prioridad en =lock_release=.

    Sin emabrgo en =lock_release= ésto puede ser incorrecto dado que un
    thread puede tener varios locks;

    en lugar de eso es conveniente guardar la variable =old_priority= en
    el =struct lock=.

    Para la segunda prueba, no hay que dejar que se bajen la prioridad
    aquellos threads a los que se donó prioridad.

    Para ello en el =struct thread= guardamos el lock que nos está donando.

    Y en =lock_aquire= Cambiamos =lock->holder->donation = lock= ; por lo
    que ya en =thread_set_priority= cambiamos directo la prioridad
    anterior accediendo al lock que guardamos.

    Si recibimos múltiples donaciones hay que guardar la prioridad
    original antes de haber entrado en contexto de donación.

    - =priority_donate_one=

      Se tiene un lock y el proceso main recibe dos donaciones, al
      hacer lock release se deshace de las prioridades donadas.

    - =priority_donate_lower=

      La prueba lo que hace es verificar que cuando un proceso con
      prioridad donada, se baja la prioridad, ésta sólo se cambia
      cuando termina el contexto de donación.

      Cuando se hace release, debe ver si el lock pertenece al mismo
      contexto de donación.

    - =priority_donate_multiple=

      Hace dos donaciones con dos locks distintos; cada proceso que
      dona una prioridado lo hace por medio de un lock distinto.

      se obtienen dos locks a y b; primero se libera b y luego a.

    - =priority_donate_multiple2=

      Lo mismo que el anterior, pero primero se libera a y luego b.

      Si todavía se encuentra en contexto de donación, no cambiamos la
      prioridad.
    
      Para ésto hay que regresar a la prioridad original, prioridad
      original guardada en el thread.

    - =priority_nest=

      Si un proceso hace una donación a alguien que donó tiene que
      esparcir esas donaciones.

      Hay que guardar un apuntador al thread al que donaron; verificar
      si dicha variable no es nulo; y mientras sea así, actualizamos
      la variable.

** Clase 22

