notas/SO/Notas.html

<div id="outline-container-orgac6e2e1" class="outline-3">
<h3 id="orgac6e2e1">Laboratiorio 8</h3>
<div class="outline-text-3" id="text-orgac6e2e1">
</div>
<div id="outline-container-org32bf54a" class="outline-4">
<h4 id="org32bf54a">Práctica 4: Sincronización</h4>
<div class="outline-text-4" id="text-org32bf54a">
<p>
Utilizar como base la práctica 2.
</p>

<p>
Si queremos usar un dispositivo externo, un ejemplo (mal hecho)
sería el siguiente:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">device_init</span> = 0;

<span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">do_something</span>(){
  <span style="font-weight: bold;">if</span> (device_init == 0){
    device_init = 1;
    init_device();
  }
  use_device();
}
</pre>
</div>

<p>
Es incorrecto pues con procesos concurrente puede ocurrir que dos
o procesos entren al mimso tiempo en la comparación y ambos sea
correcto pues su valor está en 0 y por tanto el dispositivo se
inicializaría más de una vez.
</p>

<p>
Una solución correcta sería utilizar semáforos
</p>

<p>
El semáforo utiliza un while, pues otro hilo al hacer sema<sub>up</sub>,
puede cambiar el valor del semáforo y el primer thread no volvería
a revisar su valor, y por tanto dos hilos podrían entrar a la
sección crítica.
</p>

<p>
En multinúcleo apagar las interrupciones usando semáforos no
funciona pues se desactivarían sólo las interrupciones de un sólo
núcleo.
</p>

<p>
<code>thread.h</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span>{
  <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">...</span>
  <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">priority_old</span>;
  <span style="font-weight: bold; font-style: italic;">//</span>
}
</pre>
</div>

<p>
<code>synch.c</code>
</p>

<p>
inicializar old<sub>priority</sub> en -1.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="font-weight: bold;">lock_acquire</span>(<span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">lock</span> *<span style="font-weight: bold; font-style: italic;">lock</span>){
  <span style="font-weight: bold; font-style: italic;">///</span><span style="font-weight: bold; font-style: italic;">...</span>
  <span style="font-weight: bold;">struct</span> <span style="font-weight: bold; text-decoration: underline;">thread</span> *<span style="font-weight: bold; font-style: italic;">t</span> = thread_current();
  <span style="font-weight: bold;">if</span> (lock-&gt;holder != <span style="font-weight: bold; text-decoration: underline;">NULL</span> &amp;&amp; lock-&gt;holder-&gt;priority &lt; t-&gt;priority){
    lock-&gt;old_priority = t-&gt;holder-&gt;priority;
    lock-&gt;holder-&gt;priority = t-&gt;priority;
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">t-&gt;donation = lock</span>
    lock-&gt;holder-&gt;donation = lock
  }
  sema_down(&amp;lock-&gt;semaphore);
  lock-&gt;holder = thread_current();
}
</pre>
</div>

<p>
devolver la prioridad en <code>lock_release</code>.
</p>

<p>
Sin emabrgo en <code>lock_release</code> ésto puede ser incorrecto dado que un
thread puede tener varios locks;
</p>

<p>
en lugar de eso es conveniente guardar la variable <code>old_priority</code> en
el <code>struct lock</code>.
</p>

<p>
Para la segunda prueba, no hay que dejar que se bajen la prioridad
aquellos threads a los que se donó prioridad.
</p>

<p>
Para ello en el <code>struct thread</code> guardamos el lock que nos está donando.
</p>

<p>
Y en <code>lock_aquire</code> Cambiamos <code>lock-&gt;holder-&gt;donation = lock</code> ; por lo
que ya en <code>thread_set_priority</code> cambiamos directo la prioridad
anterior accediendo al lock que guardamos.
</p>

<p>
Si recibimos múltiples donaciones hay que guardar la prioridad
original antes de haber entrado en contexto de donación.
</p>

<ul class="org-ul">
<li><p>
<code>priority_donate_one</code>
</p>

<p>
Se tiene un lock y el proceso main recibe dos donaciones, al
hacer lock release se deshace de las prioridades donadas.
</p></li>

<li><p>
<code>priority_donate_lower</code>
</p>

<p>
La prueba lo que hace es verificar que cuando un proceso con
prioridad donada, se baja la prioridad, ésta sólo se cambia
cuando termina el contexto de donación.
</p>

<p>
Cuando se hace release, debe ver si el lock pertenece al mismo
contexto de donación.
</p></li>

<li><p>
<code>priority_donate_multiple</code>
</p>

<p>
Hace dos donaciones con dos locks distintos; cada proceso que
dona una prioridado lo hace por medio de un lock distinto.
</p>

<p>
se obtienen dos locks a y b; primero se libera b y luego a.
</p></li>

<li><p>
<code>priority_donate_multiple2</code>
</p>

<p>
Lo mismo que el anterior, pero primero se libera a y luego b.
</p>

<p>
Si todavía se encuentra en contexto de donación, no cambiamos la
prioridad.
</p>

<p>
Para ésto hay que regresar a la prioridad original, prioridad
original guardada en el thread.
</p></li>

<li><p>
<code>priority_nest</code>
</p>

<p>
Si un proceso hace una donación a alguien que donó tiene que
esparcir esas donaciones.
</p>

<p>
Hay que guardar un apuntador al thread al que donaron; verificar
si dicha variable no es nulo; y mientras sea así, actualizamos
la variable.
</p></li>
</ul>
</div>
</div>
</div>
