content/notas/SO/Notas.org
*** Sistemas operativos (repaso)

    *Sistema Operativo*
    
    Es un administrador de recursos que actúa como el intermediario
    entre el hardware y el usuario final.

    *Tareas de un Sistema Operativo*
    
    Realiza la gestión de procesos, recursos, archivos, dispositivos
    de entrada-salida, protección y seguridad.

    *Pasos que realiza un procesador*

    Fetch, Decode, Execute, (Write), Check Interruption.

    - Fetch: Obtener la instrucción

    - Decode: Ver en qué consiste la instrucción

    - Execute: Ejecuta la instrucción

    - Write: De ser necesario almacena valores en registros

    - Check interruption: Revisa si hay interrupciones.


    *Llamadas al sistema*
    
    Una llamada al sistema es una petición por software similar a una
    interrupción por software.

    *¿Por qué el cambio de sistemas monoprocesador a multiprocesador?*

    Se cambió a sistemas multiprocesador por el rendimiento y por el
    surgimiento de sistemas multiusuario que aumentaban la carga de
    los sistemas.

    *¿Qué son las trampas?*

    Una trampa puede ser una señal (o en algunos casos una
    interrupción) que generalmente informa de un error a otra entidad
    del sistema, como al mismo sistema o a otro proceso.
    
    *Características de los sistemas multiprocesador*

    - Tienen por lo general un mejor rendimiento dado que puede
      realizar múltiples tareas simultáneamente.

    - Tiene uno o más hilos por cada núcleo.

    - Tienen uno o más niveles de caché por núcleo.

    - Todos los procesadores tienen el mismo rendimiento para acceder
      a memoria.


    *Calendarización*
    
    La calendarización es una parte del Sistema Operativo por medio
    del cual se decide el orden y tiempo de uso de procesador que se
    le van a dar a los procesos.

    *Niveles de protección en un sistema operativo*
    
    Los niveles de protección que tienen los procesadores son:

    - Modo usuario

    - Modo kernel, modo supervisor, o modo privilegiado


    *¿Cómo ocurren las transiciones de modo usuario a modo kernel?*

    - Al cargar el kernel; que generalmente se hace mediante el
      bootloader, se inicializa en modo kernel, y al terminar se pasa
      a modo usuario.

    - Cuando ocurre una interrupción por hardware o software, o al
      ocurrir un error, se cambia de modo usuario a modo kernel.

    - Cuando ocurren llamadas al sistema.


    *Proceso*
    
    Un proceso es una tarea en ejecución o que se va a ejecutar

    *Tipos de memoria en un sistema*
    
    Los 4 tipos de memoria en un sistema son:

    - RAM (Memoria Principal)

    - Discos duros (Memoria Secundaria)

    - Caché

    - Registros del CPU


    *¿Qué es una máquina virtual?*

    Software que emula un sistema de cómputo.

    *Proceso actual*
    
    El proceso actual es el proceso que se encuentra en ejecución en
    un instante.

    *Descriptor de hardware*

    Un descriptor de hardware de proceso almacena la información del
    estado de un proceso.

    *Idea de la demostración del protocolo "Productores-Consumidores"*

    En caso de no ser correcto, entonces deben existir dos o más
    procesos que se encuentran en la sección crítica (la manipulación
    de la colección finita).

    Según la especificación, entonces ésto quiere decir decir que al
    menos dos procesos en su función =wait= vieron que había lugares
    disponibles (o había elementos, según sea el caso) en la
    colección, y que ambos vieron que el búfer era manipulable, sin
    embargo el primero de ellos debió haber hecho que el estado del
    semáforo cambiará por la función =wait= y como ambos se encuentran
    en la sección crítica, éste primer proceso aún no utiliza la
    función =signal= para éste semáforo, por tanto no debió haber pasado
    el segundo.

    Esto último es una contradicción, y como vino de suponer que el
    protocolo no funcionaba correctamente, seguimos entonces que el
    protocolo de Productores-Consumidores es correcto.

    *Embriones/Precursores de los sistemas operativos*

    - Sistemas de procesamiento de Lote (Batch-Processing Systems):

      En estos sistemas los usuarios enviaban trabajos en lotes, y la
      computadora los procesaba secuencialmente.

    - Programas Monitores:

      Eran sistemas de Software que proporcionaban funcionalidad
      básica de gestión de recursos y programación.

    - Sistemas de Tiempo Compartido:

      Permitían a varios usuarios compartir el mismo sistema
      informático simultáneamente, y cada uno de ellos podía acceder a
      una "máquina virtual" o una porción de tiempo de los recursos
      del sistema.

    - Sistemas de multiprogramación:

      Fueron diseñados para aumentar la utilización de los recusrsos
      informáticos permitiendo que varios programas se cargaran en
      memoria simultáneamente. Utilizaban técnicas como el
      intercambio, paginación y segmentación para asignar la gestión
      de memoria a diferentes programas.

    - Programas de Control:

      Proporcionaban un control básico y coordinación de los
      dispositivos de entrada/salida y recursos del sistema.

    - Sistemas de Archivos:

      Gestionan el almacenamiento y recuperación de archivos en
      dispositivos de alamacenamiento.

** Clase 23
   
*** Page Replacement

    - Cadena de referencia: Al evaluar un algoritmo se toma una cadena
      de memoria en particular, denominada como "cadena de
      referencia".

    - Page Frames: Páginas en dodnde se pueden asignar una parte de la
      Cadena de Referencia.

      *Optimal Page Replacement* guarda en frames de tamaño finito
      partes de la cadena de referencia, de tal manera que se guardan
      todas los datos que se van a usar eventualmente revisando el
      resto de la cadena en cada iteración.

      *LRU Page Replacement* 

** Clase 24

*** Administración de memoria

**** Motivación

     1. Realojamiento

	- Es imposible saber de antemano qué otros procesos se
          ejcutarán al mismo tiempo.

	- El programador no puede hacer referencias a posiciones de
          memoria absolutas.

     2. Protección

	- Un proceso no debe tener acceso a la memoria de otro

	  - Todos los accesos a memoria se deben checar en tiempo de
            ejecución para asegurarse de que se refieren al espacio de
            momria del proceso actual.

     3. Compartición

	- A veces hace falta compartir memoria entre procesos.

	  - Instancias del mismo programa pueden convenientemente
            compartir una sola copia del programa.

	  - Consumidores/Productores deben compartir un buffer.

     4. Intercambio de memoria: Swapping

	- La RAM es típicamente pequeña: conviene usar discos para
          "extender" la memoria.

	- Se puede hacer a mano (overlay programming)

	  - Complicado, propenso a errores

	- O con ayuda de la computadora (Memoria de intercambio)

