notas/SO/Notas.html

<div id="outline-container-org99586de" class="outline-3">
<h3 id="org99586de">Clase 22</h3>
<div class="outline-text-3" id="text-org99586de">
</div>
<div id="outline-container-org94d38a9" class="outline-4">
<h4 id="org94d38a9">Sistemas operativos (repaso)</h4>
<div class="outline-text-4" id="text-org94d38a9">
<p>
<b>Sistema Operativo</b>
</p>

<p>
Es un administrador de recursos que actúa como el intermediario
entre el hardware y el usuario final.
</p>

<p>
<b>Tareas de un Sistema Operativo</b>
</p>

<p>
Realiza la gestión de procesos, recursos, archivos, dispositivos
de entrada-salida, protección y seguridad.
</p>

<p>
<b>Pasos que realiza un procesador</b>
</p>

<p>
Fetch, Decode, Execute, (Write), Check Interruption.
</p>

<ul class="org-ul">
<li>Fetch: Obtener la instrucción</li>

<li>Decode: Ver en qué consiste la instrucción</li>

<li>Execute: Ejecuta la instrucción</li>

<li>Write: De ser necesario almacena valores en registros</li>

<li>Check interruption: Revisa si hay interrupciones.</li>
</ul>


<p>
<b>Llamadas al sistema</b>
</p>

<p>
Una llamada al sistema es una petición por software similar a una
interrupción por software.
</p>

<p>
<b>¿Por qué el cambio de sistemas monoprocesador a multiprocesador?</b>
</p>

<p>
Se cambió a sistemas multiprocesador por el rendimiento y por el
surgimiento de sistemas multiusuario que aumentaban la carga de
los sistemas.
</p>

<p>
<b>¿Qué son las trampas?</b>
</p>

<p>
Una trampa puede ser una señal (o en algunos casos una
interrupción) que generalmente informa de un error a otra entidad
del sistema, como al mismo sistema o a otro proceso.
</p>

<p>
<b>Características de los sistemas multiprocesador</b>
</p>

<ul class="org-ul">
<li>Tienen por lo general un mejor rendimiento dado que puede
realizar múltiples tareas simultáneamente.</li>

<li>Tiene uno o más hilos por cada núcleo.</li>

<li>Tienen uno o más niveles de caché por núcleo.</li>

<li>Todos los procesadores tienen el mismo rendimiento para acceder
a memoria.</li>
</ul>


<p>
<b>Calendarización</b>
</p>

<p>
La calendarización es una parte del Sistema Operativo por medio
del cual se decide el orden y tiempo de uso de procesador que se
le van a dar a los procesos.
</p>

<p>
<b>Niveles de protección en un sistema operativo</b>
</p>

<p>
Los niveles de protección que tienen los procesadores son:
</p>

<ul class="org-ul">
<li>Modo usuario</li>

<li>Modo kernel, modo supervisor, o modo privilegiado</li>
</ul>


<p>
<b>¿Cómo ocurren las transiciones de modo usuario a modo kernel?</b>
</p>

<ul class="org-ul">
<li>Al cargar el kernel; que generalmente se hace mediante el
bootloader, se inicializa en modo kernel, y al terminar se pasa
a modo usuario.</li>

<li>Cuando ocurre una interrupción por hardware o software, o al
ocurrir un error, se cambia de modo usuario a modo kernel.</li>

<li>Cuando ocurren llamadas al sistema.</li>
</ul>


<p>
<b>Proceso</b>
</p>

<p>
Un proceso es una tarea en ejecución o que se va a ejecutar
</p>

<p>
<b>Tipos de memoria en un sistema</b>
</p>

<p>
Los 4 tipos de memoria en un sistema son:
</p>

<ul class="org-ul">
<li>RAM (Memoria Principal)</li>

<li>Discos duros (Memoria Secundaria)</li>

<li>Caché</li>

<li>Registros del CPU</li>
</ul>


<p>
<b>¿Qué es una máquina virtual?</b>
</p>

<p>
Software que emula un sistema de cómputo.
</p>

<p>
<b>Proceso actual</b>
</p>

<p>
El proceso actual es el proceso que se encuentra en ejecución en
un instante.
</p>

<p>
<b>Descriptor de hardware</b>
</p>

<p>
Un descriptor de hardware de proceso almacena la información del
estado de un proceso.
</p>

<p>
<b>Idea de la demostración del protocolo "Productores-Consumidores"</b>
</p>

<p>
En caso de no ser correcto, entonces deben existir dos o más
procesos que se encuentran en la sección crítica (la manipulación
de la colección finita).
</p>

<p>
Según la especificación, entonces ésto quiere decir decir que al
menos dos procesos en su función <code>wait</code> vieron que había lugares
disponibles (o había elementos, según sea el caso) en la
colección, y que ambos vieron que el búfer era manipulable, sin
embargo el primero de ellos debió haber hecho que el estado del
semáforo cambiará por la función <code>wait</code> y como ambos se encuentran
en la sección crítica, éste primer proceso aún no utiliza la
función <code>signal</code> para éste semáforo, por tanto no debió haber pasado
el segundo.
</p>

<p>
Esto último es una contradicción, y como vino de suponer que el
protocolo no funcionaba correctamente, seguimos entonces que el
protocolo de Productores-Consumidores es correcto.
</p>

<p>
<b>Embriones/Precursores de los sistemas operativos</b>
</p>

<ul class="org-ul">
<li><p>
Sistemas de procesamiento de Lote (Batch-Processing Systems):
</p>

<p>
En estos sistemas los usuarios enviaban trabajos en lotes, y la
computadora los procesaba secuencialmente.
</p></li>

<li><p>
Programas Monitores:
</p>

<p>
Eran sistemas de Software que proporcionaban funcionalidad
básica de gestión de recursos y programación.
</p></li>

<li><p>
Sistemas de Tiempo Compartido:
</p>

<p>
Permitían a varios usuarios compartir el mismo sistema
informático simultáneamente, y cada uno de ellos podía acceder a
una "máquina virtual" o una porción de tiempo de los recursos
del sistema.
</p></li>

<li><p>
Sistemas de multiprogramación:
</p>

<p>
Fueron diseñados para aumentar la utilización de los recusrsos
informáticos permitiendo que varios programas se cargaran en
memoria simultáneamente. Utilizaban técnicas como el
intercambio, paginación y segmentación para asignar la gestión
de memoria a diferentes programas.
</p></li>

<li><p>
Programas de Control:
</p>

<p>
Proporcionaban un control básico y coordinación de los
dispositivos de entrada/salida y recursos del sistema.
</p></li>

<li><p>
Sistemas de Archivos:
</p>

<p>
Gestionan el almacenamiento y recuperación de archivos en
dispositivos de alamacenamiento.
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9b9d181" class="outline-3">
<h3 id="org9b9d181">Clase 23</h3>
<div class="outline-text-3" id="text-org9b9d181">
</div>
<div id="outline-container-org0f4c47c" class="outline-4">
<h4 id="org0f4c47c">Page Replacement</h4>
<div class="outline-text-4" id="text-org0f4c47c">
<ul class="org-ul">
<li>Cadena de referencia: Al evaluar un algoritmo se toma una cadena
de memoria en particular, denominada como "cadena de
referencia".</li>

<li><p>
Page Frames: Páginas en dodnde se pueden asignar una parte de la
Cadena de Referencia.
</p>

<p>
<b>Optimal Page Replacement</b> guarda en frames de tamaño finito
partes de la cadena de referencia, de tal manera que se guardan
todas los datos que se van a usar eventualmente revisando el
resto de la cadena en cada iteración.
</p>

<p>
<b>LRU Page Replacement</b> 
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga7bf1e5" class="outline-3">
<h3 id="orga7bf1e5">Clase 24</h3>
<div class="outline-text-3" id="text-orga7bf1e5">
</div>
<div id="outline-container-orge14958c" class="outline-4">
<h4 id="orge14958c">Administración de memoria</h4>
<div class="outline-text-4" id="text-orge14958c">
</div>
<ul class="org-ul">
<li><a id="orgebac84a"></a>Motivación<br />
<div class="outline-text-5" id="text-orgebac84a">
<ol class="org-ol">
<li>Realojamiento

<ul class="org-ul">
<li>Es imposible saber de antemano qué otros procesos se
ejcutarán al mismo tiempo.</li>

<li>El programador no puede hacer referencias a posiciones de
memoria absolutas.</li>
</ul></li>

<li>Protección

<ul class="org-ul">
<li>Un proceso no debe tener acceso a la memoria de otro

<ul class="org-ul">
<li>Todos los accesos a memoria se deben checar en tiempo de
ejecución para asegurarse de que se refieren al espacio de
momria del proceso actual.</li>
</ul></li>
</ul></li>

<li>Compartición

<ul class="org-ul">
<li>A veces hace falta compartir memoria entre procesos.

<ul class="org-ul">
<li>Instancias del mismo programa pueden convenientemente
compartir una sola copia del programa.</li>

<li>Consumidores/Productores deben compartir un buffer.</li>
</ul></li>
</ul></li>

<li>Intercambio de memoria: Swapping

<ul class="org-ul">
<li>La RAM es típicamente pequeña: conviene usar discos para
"extender" la memoria.</li>

<li>Se puede hacer a mano (overlay programming)

<ul class="org-ul">
<li>Complicado, propenso a errores</li>
</ul></li>

<li>O con ayuda de la computadora (Memoria de intercambio)</li>
</ul></li>
</ol>
</div>
</li>
