content/notas/SO/Notas.org
**** Memoria Virtual

     - Mecanismo de traducción de direcciones en tiempo de ejecución
       (mapeo de direcciones)

     - Distinción entre

       - Direcciones de programa (programador, procesador)

       - Direcciones de memoria (hardware)

     - Espacio de direcciones /virtuales/, Espacio de memoria /física/.

       - $f:D\rightarrow M$

**** Espacio de direcciones virtual

     - No necesariamente es lineal

     - Puede ser mayor, menor o igual que el espacio de memoria.

     - El programador "ve" y "usa" una /memoria virtual/, diferente a la
       memoria /física/.

*** Implementación de memoria virtual

**** Registros base y límite

     - El registro base contiene la menor dirección accedida por el
       proceso.

       - Todo acceso a la memori de este proceso es relativo a esa
         dirección base.

	 - $f(a)=B+a$

     - La /relocalización/ es trivial

     - La /protección/ se lleva a cabo /limitando/ la /máxima/ dirección
       referenciable: /registro límite/.

     - Ayuda a cubrir los requisitos de /relocalización/ y /protección/.

** Clase 25

*** Implementación de memoria virtual

**** Registros base y límite

     1. Si $a<0$; violación de memoria.

     2. $a'=B+a$

     3. Si $a'>limite$: violación de memoria.

     4. $a'$ es la dirección física solicitada.


     Notemos que:

     - El espacio de direcciones es lineal.
     - El espacio de direcciones es menor o igual que el espacio de
       memoria.
     - No hay compartición.

**** Paginación

     - Se inventó en los 60s

     - El espacio de direcciones virtual se divide en páginas

       - Bloque de direcciones de memoria de tamño fijo

     - La memoria RAM de sivide en marcos de página.

       - Bloque de direcciones de memoria de tamaño fijo

     - Los marcos de página se reparten entre los procesos.

       - En un momento dado, un proceso tiene páginas.
   
** Clase 26

*** Memoria virtual

    Idealmente quisieramos que todo nuestro programa estuviera
    completo en la meoria principal.

    - Memoria lógica: Memoria "intangible" creada por el sistema
      operativo manejado con direcciones lógicas.

    - Memoria virtual: incluye la separación de

    - MMU (Memory Management Unit)

    - Paginación por demanda:

** Clase 27

*** Memoria Virtual    
**** Paginación

     Lo que hace la MMU en tiempo de ejecución es recibir una
     dirección de memoria virtual y ésta lo mapea a una direción de
     memoria física.
     
***** ¿A qué página física corresponde la página virtual p?

      - Tabla de páginas (esquema simple):

	- Una tabla por proceso: un apuntador a la tabla del proceso
          actual ser carga en un registro del procesador.

	- La entrada $p$ - ésima indica el marco de página que le
          corresponde a la página $p$, y un poco de información
          administrativa:

	  - Cuántas veces la página se ha referenciado.

	  - Tiempo de última referencia.

	  - Si se ha escrito a esa dirección.

** Clase 28

*** Múltiples niveles de tablas

    - Se divide el total de p´aginas en directorios de tamaño fijo.

      - Pentium y posteirores: dos niveles.

      - Sparc (32 bits): 3 niveles.

      - Motorola 68030 (32 bits): 4 niveles.

    - Se realiza un acceso a RAM por cada nivel de "página".

** Clase 29

*** Paginación

    Hay una tabla de paginación por proceso en el sistema.

    Debe haber un apuntador a la tabla del proceso actual en un
    registro del procesador.

    Para cambiar de proceso acutal, recuperamos la dirección de la TAP
    del nuevo proceso a partir de su descriptor de HW, y la escribimos
    en el registro adecuado de la MMU.

    Invalidamos las entradas del TLB.

    Restauramos el resto del entorno volátil del proceso a ejecutar.

*** Ejemplos de aplicaciones de paginación:

    - Comparir memoria:

      - Páginas virtuales de diferentes procesos se asocian a la misma
        página física.

      - Si la memoria no es totalmente compartida: copy-on-write

	- Es un mecanismo que permite posponer la copia de bloques de memoria hasta que uno de los procesos hace una modificación sobre ese bloque.

      - Archivos mapeados a memoria:

	- Es una técnica para facilitar el acceso a archivos: el
          archivo se ve cocmo un "arreglo" en memoria.


    ZSWAP: Compresión de memoria en lugar de mandarla a almacenamiento
    secundario (en la práctica ocurre una combinación de ZSWAP e
    intercambio).

*** Estrategias de reemplazo de página

    Cuando una falla de página ocurre, pude ser necesario traer la página referenciada de memoria secunda a RAM.

    - Es posible que no haya una página física libre para poder copiar
      esta página en ella.

    - Debemos entonces "hacer espacio" en la RAM.

    - ¿De qué manera podemos hacer espacio?

      - Mandar todo un procesos a disco.

      - Estrategias de reemplazo de páginas.

    - Las que no usan estadísticas de uso.

    - Las que sí usan estadísticas de uso.

      - Referenced bit

      - Dirty bit.
      
** Clase 30

*** Estrategias que no usan estadísticas de uso

    - FIFO: El primero en entrar es el pimero en salir.

      - Fácil de implementar. Sólo hace galta implementar una cola
        (lista doblemente ligada por ejemplo).

      - Sin embargo tiene un desempeño pobre:

	- Ignora que la página más vieja puede ser la más
          referenciada

	- Sucede el fenómeno "anomalía de Belady":

	  - Incrementar la memoria baja el desempeño.

*** Anomalía de Belady.

    Existen dos tamaños de memoria uno menor que el otro, tal que el
    número de fallos en la secuencia de referencias del primer tamaño
    de memoria es menor que el segundo tamaño de memoria.

