notas/SO/Notas.html

<li><a id="org19b8cc3"></a>Memoria Virtual<br />
<div class="outline-text-5" id="text-org19b8cc3">
<ul class="org-ul">
<li>Mecanismo de traducción de direcciones en tiempo de ejecución
(mapeo de direcciones)</li>

<li>Distinción entre

<ul class="org-ul">
<li>Direcciones de programa (programador, procesador)</li>

<li>Direcciones de memoria (hardware)</li>
</ul></li>

<li>Espacio de direcciones <i>virtuales</i>, Espacio de memoria <i>física</i>.

<ul class="org-ul">
<li>\(f:D\rightarrow M\)</li>
</ul></li>
</ul>
</div>
</li>

<li><a id="org23fa345"></a>Espacio de direcciones virtual<br />
<div class="outline-text-5" id="text-org23fa345">
<ul class="org-ul">
<li>No necesariamente es lineal</li>

<li>Puede ser mayor, menor o igual que el espacio de memoria.</li>

<li>El programador "ve" y "usa" una <i>memoria virtual</i>, diferente a la
memoria <i>física</i>.</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org58ec2d6" class="outline-4">
<h4 id="org58ec2d6">Implementación de memoria virtual</h4>
<div class="outline-text-4" id="text-org58ec2d6">
</div>
<ul class="org-ul">
<li><a id="org1808a90"></a>Registros base y límite<br />
<div class="outline-text-5" id="text-org1808a90">
<ul class="org-ul">
<li>El registro base contiene la menor dirección accedida por el
proceso.

<ul class="org-ul">
<li>Todo acceso a la memori de este proceso es relativo a esa
dirección base.

<ul class="org-ul">
<li>\(f(a)=B+a\)</li>
</ul></li>
</ul></li>

<li>La <i>relocalización</i> es trivial</li>

<li>La <i>protección</i> se lleva a cabo <i>limitando</i> la <i>máxima</i> dirección
referenciable: <i>registro límite</i>.</li>

<li>Ayuda a cubrir los requisitos de <i>relocalización</i> y <i>protección</i>.</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8745b26" class="outline-3">
<h3 id="org8745b26">Clase 25</h3>
<div class="outline-text-3" id="text-org8745b26">
</div>
<div id="outline-container-orgee456e6" class="outline-4">
<h4 id="orgee456e6">Implementación de memoria virtual</h4>
<div class="outline-text-4" id="text-orgee456e6">
</div>
<ul class="org-ul">
<li><a id="orgf7d8398"></a>Registros base y límite<br />
<div class="outline-text-5" id="text-orgf7d8398">
<ol class="org-ol">
<li>Si \(a<0\); violación de memoria.</li>

<li>\(a'=B+a\)</li>

<li>Si \(a'>limite\): violación de memoria.</li>

<li>\(a'\) es la dirección física solicitada.</li>
</ol>


<p>
Notemos que:
</p>

<ul class="org-ul">
<li>El espacio de direcciones es lineal.</li>
<li>El espacio de direcciones es menor o igual que el espacio de
memoria.</li>
<li>No hay compartición.</li>
</ul>
</div>
</li>

<li><a id="org9ab1ada"></a>Paginación<br />
<div class="outline-text-5" id="text-org9ab1ada">
<ul class="org-ul">
<li>Se inventó en los 60s</li>

<li>El espacio de direcciones virtual se divide en páginas

<ul class="org-ul">
<li>Bloque de direcciones de memoria de tamño fijo</li>
</ul></li>

<li>La memoria RAM de sivide en marcos de página.

<ul class="org-ul">
<li>Bloque de direcciones de memoria de tamaño fijo</li>
</ul></li>

<li>Los marcos de página se reparten entre los procesos.

<ul class="org-ul">
<li>En un momento dado, un proceso tiene páginas.</li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7d80e31" class="outline-3">
<h3 id="org7d80e31">Clase 26</h3>
<div class="outline-text-3" id="text-org7d80e31">
</div>
<div id="outline-container-org7eb39e1" class="outline-4">
<h4 id="org7eb39e1">Memoria virtual</h4>
<div class="outline-text-4" id="text-org7eb39e1">
<p>
Idealmente quisieramos que todo nuestro programa estuviera
completo en la meoria principal.
</p>

<ul class="org-ul">
<li>Memoria lógica: Memoria "intangible" creada por el sistema
operativo manejado con direcciones lógicas.</li>

<li>Memoria virtual: incluye la separación de</li>

<li>MMU (Memory Management Unit)</li>

<li>Paginación por demanda:</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc58d370" class="outline-3">
<h3 id="orgc58d370">Clase 27</h3>
<div class="outline-text-3" id="text-orgc58d370">
</div>
<div id="outline-container-orgd085061" class="outline-4">
<h4 id="orgd085061">Memoria Virtual</h4>
<div class="outline-text-4" id="text-orgd085061">
</div>
<ul class="org-ul">
<li><a id="org8a79540"></a>Paginación<br />
<div class="outline-text-5" id="text-org8a79540">
<p>
Lo que hace la MMU en tiempo de ejecución es recibir una
dirección de memoria virtual y ésta lo mapea a una direción de
memoria física.
</p>
</div>

<ul class="org-ul">
<li><a id="org8971305"></a>¿A qué página física corresponde la página virtual p?<br />
<div class="outline-text-6" id="text-org8971305">
<ul class="org-ul">
<li>Tabla de páginas (esquema simple):

<ul class="org-ul">
<li>Una tabla por proceso: un apuntador a la tabla del proceso
actual ser carga en un registro del procesador.</li>

<li>La entrada \(p\) - ésima indica el marco de página que le
corresponde a la página \(p\), y un poco de información
administrativa:

<ul class="org-ul">
<li>Cuántas veces la página se ha referenciado.</li>

<li>Tiempo de última referencia.</li>

<li>Si se ha escrito a esa dirección.</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7276fda" class="outline-3">
<h3 id="org7276fda">Clase 28</h3>
<div class="outline-text-3" id="text-org7276fda">
</div>
<div id="outline-container-org3e97dcc" class="outline-4">
<h4 id="org3e97dcc">Múltiples niveles de tablas</h4>
<div class="outline-text-4" id="text-org3e97dcc">
<ul class="org-ul">
<li>Se divide el total de p´aginas en directorios de tamaño fijo.

<ul class="org-ul">
<li>Pentium y posteirores: dos niveles.</li>

<li>Sparc (32 bits): 3 niveles.</li>

<li>Motorola 68030 (32 bits): 4 niveles.</li>
</ul></li>

<li>Se realiza un acceso a RAM por cada nivel de "página".</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga3c9e48" class="outline-3">
<h3 id="orga3c9e48">Clase 29</h3>
<div class="outline-text-3" id="text-orga3c9e48">
</div>
<div id="outline-container-org83690e5" class="outline-4">
<h4 id="org83690e5">Paginación</h4>
<div class="outline-text-4" id="text-org83690e5">
<p>
Hay una tabla de paginación por proceso en el sistema.
</p>

<p>
Debe haber un apuntador a la tabla del proceso actual en un
registro del procesador.
</p>

<p>
Para cambiar de proceso acutal, recuperamos la dirección de la TAP
del nuevo proceso a partir de su descriptor de HW, y la escribimos
en el registro adecuado de la MMU.
</p>

<p>
Invalidamos las entradas del TLB.
</p>

<p>
Restauramos el resto del entorno volátil del proceso a ejecutar.
</p>
</div>
</div>

<div id="outline-container-org3e7c26e" class="outline-4">
<h4 id="org3e7c26e">Ejemplos de aplicaciones de paginación:</h4>
<div class="outline-text-4" id="text-org3e7c26e">
<ul class="org-ul">
<li>Comparir memoria:

<ul class="org-ul">
<li>Páginas virtuales de diferentes procesos se asocian a la misma
página física.</li>

<li>Si la memoria no es totalmente compartida: copy-on-write

<ul class="org-ul">
<li>Es un mecanismo que permite posponer la copia de bloques de memoria hasta que uno de los procesos hace una modificación sobre ese bloque.</li>
</ul></li>

<li>Archivos mapeados a memoria:

<ul class="org-ul">
<li>Es una técnica para facilitar el acceso a archivos: el
archivo se ve cocmo un "arreglo" en memoria.</li>
</ul></li>
</ul></li>
</ul>


<p>
ZSWAP: Compresión de memoria en lugar de mandarla a almacenamiento
secundario (en la práctica ocurre una combinación de ZSWAP e
intercambio).
</p>
</div>
</div>

<div id="outline-container-org6e1e694" class="outline-4">
<h4 id="org6e1e694">Estrategias de reemplazo de página</h4>
<div class="outline-text-4" id="text-org6e1e694">
<p>
Cuando una falla de página ocurre, pude ser necesario traer la página referenciada de memoria secunda a RAM.
</p>

<ul class="org-ul">
<li>Es posible que no haya una página física libre para poder copiar
esta página en ella.</li>

<li>Debemos entonces "hacer espacio" en la RAM.</li>

<li>¿De qué manera podemos hacer espacio?

<ul class="org-ul">
<li>Mandar todo un procesos a disco.</li>

<li>Estrategias de reemplazo de páginas.</li>
</ul></li>

<li>Las que no usan estadísticas de uso.</li>

<li>Las que sí usan estadísticas de uso.

<ul class="org-ul">
<li>Referenced bit</li>

<li>Dirty bit.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1066eeb" class="outline-3">
<h3 id="org1066eeb">Clase 30</h3>
<div class="outline-text-3" id="text-org1066eeb">
</div>
<div id="outline-container-org9ab4abc" class="outline-4">
<h4 id="org9ab4abc">Estrategias que no usan estadísticas de uso</h4>
<div class="outline-text-4" id="text-org9ab4abc">
<ul class="org-ul">
<li>FIFO: El primero en entrar es el pimero en salir.

<ul class="org-ul">
<li>Fácil de implementar. Sólo hace galta implementar una cola
(lista doblemente ligada por ejemplo).</li>

<li>Sin embargo tiene un desempeño pobre:

<ul class="org-ul">
<li>Ignora que la página más vieja puede ser la más
referenciada</li>

<li>Sucede el fenómeno "anomalía de Belady":

<ul class="org-ul">
<li>Incrementar la memoria baja el desempeño.</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgea3e538" class="outline-4">
<h4 id="orgea3e538">Anomalía de Belady.</h4>
<div class="outline-text-4" id="text-orgea3e538">
<p>
Existen dos tamaños de memoria uno menor que el otro, tal que el
número de fallos en la secuencia de referencias del primer tamaño
de memoria es menor que el segundo tamaño de memoria.
</p>
</div>
</div>
