content/notas/SO/Notas.org
*** Estrategias que sí usan estadísticas de uso

    - Intentan predecir el uso futuro a partir del historial de uso
      anterior.

      - Esto se justifica mediante el principio de localidad de regerencias.

	- Reloj: Modificación simple de FIFO (Esquema más simple usado
          en la práctica).

	- LRU: La del último acceso más viejo. (Usada en la práctica)

	- LFU: Menos usadas frecuentemente.

      - La implementación es un poco más complicada y requiere ayuda
        de HW.

      - Se puede demostrar que LRU (y cualquier otra técnica con la stack propoerty)

**** Second Chance

     El candidato a página víctima es toavía la que entró primero,
     pero si esa página fue referenciada, gana otra oportunidad de
     mantenerse presente, perdiendo su estatus de "referenciada".

** Clase 31

*** Descriptor de dispositivo

    - Es una estructura de datos. Cada dispositivo tiene su propio
      descriptor. Algunos campos son:

      - identificador del dispositivo

      - Apuntadores a funciones para manipular el dispositivo.

      - Estado: Si el dispositivo está ocupado, libre o roto.

      - El proceso que lo está usando

      - Dos monitores para sincronización

    - El núcleo accede a los dispositivos mediante la lista
      "estructura de dispositivos".

** Clase 32

*** Examen Silver Chat

    - 9.3 Paging 60

    - 9.4 Structure of the Page table 371

    - 10.5 Allocation of framse 413

    - 10.8 Kernel Memory 467

*** Sobre la administración de memoria

    - Realojamieno

    - Compartición: Exclusión en la memoria

    - Protección: Durante un proceso no se puede ocupar la memoria de
      otro proceso.

    - Swapping: Si la memoria está llena, intercambia datos entre la
      memoria principal y secundaria.

      Se utiliza en caso de fallos de página

      - FIFO

      - LRU

      - OPT

    - Memoria Virtual: Mapeo de direcciones virtuales a físicas.

    - MMU: Memory Management Unit

      Comunicación entre

      - Función mapea direcciones de memoria.
    
      - Alcance de un proceso en la memoria.

    - Base Register: Indica la dirección en memoria más pequeña a la
      cual puede acceder el proceso, es decir, en donde empieza su
      espacio de dirección.

    - Limit Register: Indica el tamaño de este rango de Direcciones,
      es decir, si se le suma el "base register" y obtemnemos la
      direción en memoria más grande.

    - Demostrar por qué LRU no presenta la anomalía de Belady.

** Clase 33

*** El panorama de Entrada / Salida

    Un proceso manda a inicializar una llamada a sistema de entrada /
    salida, para posteriorimente mandar a llamar un wait para
    verificar si ya se completó la operación solicitada.

    Por otra parte en la llamada a sistema se identifica el
    dispositivo por su device descriptor, encola el nuevo trabajo y
    hace un signal de que hay un trabajo pendiente para el
    dispositivo.

    
**** Descriptor de dispositivo

     Cada dispositivo tiene su propio descriptor:
     
     - Identificador del dispositivo

     - Apuntadores a funciones para manipular el dispositivo.

     - Estado del dispositivo; Si está ocupado, libre, o roto

     - El proceso que lo está usando

     - Dos monitores para sincronización

     - Dos monitores para sincronización: /request pending,/ /operation
       complete/

     - Cola de trabajos


     El kernel por lo general tiene instalado un driver para controlar
     el dispositivo.

**** Driver de dispositivo

     - Hay un dispositivo "driver"por cada dispositivo

       - Su trabajo es esperar a que haya peticiones y procesarlas.

       - En un "consumidor" de IORB's


     #+begin_src prog
repite indefinidamente:
    begin
        wait(request_pending);
	toma un IORB de la cola;
	extrae los detalles de la solicitud;
	inicia operación de E/S;
	wait(operation_complete);
	if error then plant_error_info; exit # notifica al proceso que hubo un error
	traduce caracteres si es necesario;
	transfiere datos al destino;
	signal(reques_services);
	delete IORB;
     end;
     #+end_src

     Escribe de acuerdo a las especificaciones del dispositivo en sus
     registros de control.     
     
** Clase 34

*** Dispositivos de Entrada y Salida

    - Diferencias:

      - Velocidad: Los dispositivos transmiten a distintas
        velocidades.

      - Representación de Datos:

	- La forma en que codifican los datos que transmite cada
          dispositivo de E / S es distinta.

      - Operaciones permitidas:

	- El tipo de operación que piede realizar el dispositivo E/S.

	  Telcado: Entrada

	  Bocina: Salida

*** Unidad de transferencia

    Los datos de un dispositivo de Entrada / Salida son diferentes,
    por ejemplo un disco duro transmite por bloques, mientras que un
    teclado envía un sólo caracter.

*** DOIO

    =DOIO(stream, amount, mode, destination, semaphore)=

    Es el nombre del procedimiento para un dispositivo E/S

    - stream: Localiza el dispositivo por medio de señales eléctricas.

    - amount: (La cantidad / El tamaño) de los datos a transmitir.
    
    - mode: La operación a realizar por el dispositivo E/S.

    - destination: Destino de la información

    - semaphore: Almacena el estado del proceso.


    Su función principal es asignar el flujo (el trabajo) al
    dispositivo E/S (añadirlo al IORB), comprobar la consistencia de
    los parámetros, e iniciar el servicio de petición.

*** Procedimiento re-entrante

    Puede ser utilizado por varios dispositivos a la vez.

*** Descriptor de dispositivo

    - Id
      
    - Estatus

    - Características

    - Current IORB /Input-Output Request Block/

      * Destino

      * Cantidad

      * Mode

      * Next

      Es una cola de procedimientos que requiere hacer el dispositivo

    - Semáforo pendientes

    - Semáforo completados
  
*** Pasos del DOIO

    1. Se identifica el dispositivo E/S.

    2. Una vez identificado, se ven los parámetros de entrada y salida
       del dispositivo; si se detecta un error se puede mandar una
       salida para verificar.

    3. Se mete en la cola IORB.

    4. Se hace o no el procedimiento que tniene que hacer el
       dispositivo E/S.

*** alanmart12

** Clase 35

