notas/SO/Notas.html

<div id="outline-container-org8ce5eb6" class="outline-4">
<h4 id="org8ce5eb6">Estrategias que sí usan estadísticas de uso</h4>
<div class="outline-text-4" id="text-org8ce5eb6">
<ul class="org-ul">
<li>Intentan predecir el uso futuro a partir del historial de uso
anterior.

<ul class="org-ul">
<li>Esto se justifica mediante el principio de localidad de regerencias.

<ul class="org-ul">
<li>Reloj: Modificación simple de FIFO (Esquema más simple usado
en la práctica).</li>

<li>LRU: La del último acceso más viejo. (Usada en la práctica)</li>

<li>LFU: Menos usadas frecuentemente.</li>
</ul></li>

<li>La implementación es un poco más complicada y requiere ayuda
de HW.</li>

<li>Se puede demostrar que LRU (y cualquier otra técnica con la stack propoerty)</li>
</ul></li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org9190531"></a>Second Chance<br />
<div class="outline-text-5" id="text-org9190531">
<p>
El candidato a página víctima es toavía la que entró primero,
pero si esa página fue referenciada, gana otra oportunidad de
mantenerse presente, perdiendo su estatus de "referenciada".
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3d5c6dc" class="outline-3">
<h3 id="org3d5c6dc">Clase 31</h3>
<div class="outline-text-3" id="text-org3d5c6dc">
</div>
<div id="outline-container-org8026347" class="outline-4">
<h4 id="org8026347">Descriptor de dispositivo</h4>
<div class="outline-text-4" id="text-org8026347">
<ul class="org-ul">
<li>Es una estructura de datos. Cada dispositivo tiene su propio
descriptor. Algunos campos son:

<ul class="org-ul">
<li>identificador del dispositivo</li>

<li>Apuntadores a funciones para manipular el dispositivo.</li>

<li>Estado: Si el dispositivo está ocupado, libre o roto.</li>

<li>El proceso que lo está usando</li>

<li>Dos monitores para sincronización</li>
</ul></li>

<li>El núcleo accede a los dispositivos mediante la lista
"estructura de dispositivos".</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf593add" class="outline-3">
<h3 id="orgf593add">Clase 32</h3>
<div class="outline-text-3" id="text-orgf593add">
</div>
<div id="outline-container-org9e54aa5" class="outline-4">
<h4 id="org9e54aa5">Examen Silver Chat</h4>
<div class="outline-text-4" id="text-org9e54aa5">
<ul class="org-ul">
<li>9.3 Paging 60</li>

<li>9.4 Structure of the Page table 371</li>

<li>10.5 Allocation of framse 413</li>

<li>10.8 Kernel Memory 467</li>
</ul>
</div>
</div>

<div id="outline-container-org1c68c90" class="outline-4">
<h4 id="org1c68c90">Sobre la administración de memoria</h4>
<div class="outline-text-4" id="text-org1c68c90">
<ul class="org-ul">
<li>Realojamieno</li>

<li>Compartición: Exclusión en la memoria</li>

<li>Protección: Durante un proceso no se puede ocupar la memoria de
otro proceso.</li>

<li><p>
Swapping: Si la memoria está llena, intercambia datos entre la
memoria principal y secundaria.
</p>

<p>
Se utiliza en caso de fallos de página
</p>

<ul class="org-ul">
<li>FIFO</li>

<li>LRU</li>

<li>OPT</li>
</ul></li>

<li>Memoria Virtual: Mapeo de direcciones virtuales a físicas.</li>

<li><p>
MMU: Memory Management Unit
</p>

<p>
Comunicación entre
</p>

<ul class="org-ul">
<li>Función mapea direcciones de memoria.</li>

<li>Alcance de un proceso en la memoria.</li>
</ul></li>

<li>Base Register: Indica la dirección en memoria más pequeña a la
cual puede acceder el proceso, es decir, en donde empieza su
espacio de dirección.</li>

<li>Limit Register: Indica el tamaño de este rango de Direcciones,
es decir, si se le suma el "base register" y obtemnemos la
direción en memoria más grande.</li>

<li>Demostrar por qué LRU no presenta la anomalía de Belady.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7130bf4" class="outline-3">
<h3 id="org7130bf4">Clase 33</h3>
<div class="outline-text-3" id="text-org7130bf4">
</div>
<div id="outline-container-orgf98069f" class="outline-4">
<h4 id="orgf98069f">El panorama de Entrada / Salida</h4>
<div class="outline-text-4" id="text-orgf98069f">
<p>
Un proceso manda a inicializar una llamada a sistema de entrada /
salida, para posteriorimente mandar a llamar un wait para
verificar si ya se completó la operación solicitada.
</p>

<p>
Por otra parte en la llamada a sistema se identifica el
dispositivo por su device descriptor, encola el nuevo trabajo y
hace un signal de que hay un trabajo pendiente para el
dispositivo.
</p>
</div>


<ul class="org-ul">
<li><a id="org4287e84"></a>Descriptor de dispositivo<br />
<div class="outline-text-5" id="text-org4287e84">
<p>
Cada dispositivo tiene su propio descriptor:
</p>

<ul class="org-ul">
<li>Identificador del dispositivo</li>

<li>Apuntadores a funciones para manipular el dispositivo.</li>

<li>Estado del dispositivo; Si está ocupado, libre, o roto</li>

<li>El proceso que lo está usando</li>

<li>Dos monitores para sincronización</li>

<li>Dos monitores para sincronización: <i>request pending,</i> <i>operation
complete</i></li>

<li>Cola de trabajos</li>
</ul>


<p>
El kernel por lo general tiene instalado un driver para controlar
el dispositivo.
</p>
</div>
</li>

<li><a id="orge7be47e"></a>Driver de dispositivo<br />
<div class="outline-text-5" id="text-orge7be47e">
<ul class="org-ul">
<li>Hay un dispositivo "driver"por cada dispositivo

<ul class="org-ul">
<li>Su trabajo es esperar a que haya peticiones y procesarlas.</li>

<li>En un "consumidor" de IORB's</li>
</ul></li>
</ul>


<div class="org-src-container">
<pre class="src src-prog">repite indefinidamente:
    begin
        wait(request_pending);
        toma un IORB de la cola;
        extrae los detalles de la solicitud;
        inicia operaci&#243;n de E/S;
        wait(operation_complete);
        if error then plant_error_info; exit # notifica al proceso que hubo un error
        traduce caracteres si es necesario;
        transfiere datos al destino;
        signal(reques_services);
        delete IORB;
     end;
</pre>
</div>

<p>
Escribe de acuerdo a las especificaciones del dispositivo en sus
registros de control.     
</p>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-org30dfcf3" class="outline-3">
<h3 id="org30dfcf3">Clase 34</h3>
<div class="outline-text-3" id="text-org30dfcf3">
</div>
<div id="outline-container-org5b48c72" class="outline-4">
<h4 id="org5b48c72">Dispositivos de Entrada y Salida</h4>
<div class="outline-text-4" id="text-org5b48c72">
<ul class="org-ul">
<li>Diferencias:

<ul class="org-ul">
<li>Velocidad: Los dispositivos transmiten a distintas
velocidades.</li>

<li>Representación de Datos:

<ul class="org-ul">
<li>La forma en que codifican los datos que transmite cada
dispositivo de E / S es distinta.</li>
</ul></li>

<li>Operaciones permitidas:

<ul class="org-ul">
<li><p>
El tipo de operación que piede realizar el dispositivo E/S.
</p>

<p>
Telcado: Entrada
</p>

<p>
Bocina: Salida
</p></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org34d3223" class="outline-4">
<h4 id="org34d3223">Unidad de transferencia</h4>
<div class="outline-text-4" id="text-org34d3223">
<p>
Los datos de un dispositivo de Entrada / Salida son diferentes,
por ejemplo un disco duro transmite por bloques, mientras que un
teclado envía un sólo caracter.
</p>
</div>
</div>

<div id="outline-container-org342a77e" class="outline-4">
<h4 id="org342a77e">DOIO</h4>
<div class="outline-text-4" id="text-org342a77e">
<p>
<code>DOIO(stream, amount, mode, destination, semaphore)</code>
</p>

<p>
Es el nombre del procedimiento para un dispositivo E/S
</p>

<ul class="org-ul">
<li>stream: Localiza el dispositivo por medio de señales eléctricas.</li>

<li>amount: (La cantidad / El tamaño) de los datos a transmitir.</li>

<li>mode: La operación a realizar por el dispositivo E/S.</li>

<li>destination: Destino de la información</li>

<li>semaphore: Almacena el estado del proceso.</li>
</ul>


<p>
Su función principal es asignar el flujo (el trabajo) al
dispositivo E/S (añadirlo al IORB), comprobar la consistencia de
los parámetros, e iniciar el servicio de petición.
</p>
</div>
</div>

<div id="outline-container-org03e9fdb" class="outline-4">
<h4 id="org03e9fdb">Procedimiento re-entrante</h4>
<div class="outline-text-4" id="text-org03e9fdb">
<p>
Puede ser utilizado por varios dispositivos a la vez.
</p>
</div>
</div>

<div id="outline-container-orge9e8aba" class="outline-4">
<h4 id="orge9e8aba">Descriptor de dispositivo</h4>
<div class="outline-text-4" id="text-orge9e8aba">
<ul class="org-ul">
<li>Id</li>

<li>Estatus</li>

<li>Características</li>

<li><p>
Current IORB <i>Input-Output Request Block</i>
</p>

<ul class="org-ul">
<li>Destino</li>

<li>Cantidad</li>

<li>Mode</li>

<li>Next</li>
</ul>

<p>
Es una cola de procedimientos que requiere hacer el dispositivo
</p></li>

<li>Semáforo pendientes</li>

<li>Semáforo completados</li>
</ul>
</div>
</div>

<div id="outline-container-org268bd04" class="outline-4">
<h4 id="org268bd04">Pasos del DOIO</h4>
<div class="outline-text-4" id="text-org268bd04">
<ol class="org-ol">
<li>Se identifica el dispositivo E/S.</li>

<li>Una vez identificado, se ven los parámetros de entrada y salida
del dispositivo; si se detecta un error se puede mandar una
salida para verificar.</li>

<li>Se mete en la cola IORB.</li>

<li>Se hace o no el procedimiento que tniene que hacer el
dispositivo E/S.</li>
</ol>
</div>
</div>
