content/notas/SO/Notas.org
*** Preguntas

    ¿Cuáles son los componentes activos en una operacion de E/S?

    ¿Quién se comunica con quién?

    Cada dirección de comunicación, ¿de qué componente compartido se apoya?

    ¿Cúáles son los parámetros de DOIO y qué significan?

    Hay tres semáforos, ¿quién inicializa cada uno de ellos?

    - El proceso inicializador de dispositivos


    ¿Quién ejecuta al proceso driver?

    - El proceso que pide la solicitud de E/S

** Clase 36

*** Sistema de archivos

    * Archivo: Unidad de almacenamiento de archivos}

      Se utiliza un modelo de archivo como modelos de coleccion lineal
      de bytes (bloques).

    * Directorio: Estructura para mapear nombres a archivos

*** Bloques secuenciales

    - Pros:

      - Acceso aleatorio.

      - Un bloque dañado sólo saña un archivo

    - Contras: Fragmentación -> Compactación

      - Difícil añadir o eliminar bloques al interior del archivo.

      - Hay que saber de antemano la cnatidad de bloques que hay que
        asignar.

*** Bloques enlazados

    - Los bloques de un archivo se estructuran en una lista ligada
      contenida en él mismo.

    - En el directorio se guarda un apuntador al primer y último
      bloque.

    - Cada bloque tien un apuntador al siguiente.


    Pros:

    - No hay fragemntación interna.

    - No hace falta realizar compactación (aunque ayuda defrag)


    Cons:

    - Acceso secuencial únicamente, Avanzar al bloque siguiente
      implica una lectora de disco.

    - Sobrecarga de espacio por los apuntadores.


    Para minimizar las desventajas, en lugar de bloques: conjuntos de
    tamaño fijo de bloques consecutivos.

*** Tabla de asignación de archivo (FAT)

    En lugar de tener una cadena de bloques distribuida en distintas
    localizaciones, los consolidamos en una tabla de asignación
    almacenados en una región compacta del disco.
    
    - Variación del esquema enlazado.

    - El disco se divide en clusters.

    - Se hace una tabla que contiene una entrada por cluster.

    - Si el cluster c es el i-ésimo del archivo f, la entrada c-+esima
      de la tabla contiene el número del cluste i+1-eśimo de f.

    - Una entrada de directorio contiene un apuntador al prmer y
      útlimo cluster del archivo.

* Tareas [4/5]

  - [X] Práctica 1: Reimplementar la función timer_sleep para que no
    utilice espera ocupada.
  - [X] Tarea 1:
    Enviar a: alanmartinez-012@ciencias.unam.mx
    Asunto: Tarea1SO 2023-2
    Cuerpo: - Nombre Completo
    - No Cuenta
  - [X] Práctica 2
  - [X] Tarea 2
  - [ ] Primer Parcial: Miércoles 29 de marzo
    - /Embriones/ de los Sistemas Operativos
    - Ogranización de Computadoras
    - Interrupciones
    - Llamadas al sistema y señales
    - Procesos: Protocolos y semáforos
