notas/SO/Notas.html

<div id="outline-container-org996e6c1" class="outline-4">
<h4 id="org996e6c1">alanmart12</h4>
</div>
</div>

<div id="outline-container-org5031a98" class="outline-3">
<h3 id="org5031a98">Clase 35</h3>
<div class="outline-text-3" id="text-org5031a98">
</div>
<div id="outline-container-org80b7654" class="outline-4">
<h4 id="org80b7654">Preguntas</h4>
<div class="outline-text-4" id="text-org80b7654">
<p>
¿Cuáles son los componentes activos en una operacion de E/S?
</p>

<p>
¿Quién se comunica con quién?
</p>

<p>
Cada dirección de comunicación, ¿de qué componente compartido se apoya?
</p>

<p>
¿Cúáles son los parámetros de DOIO y qué significan?
</p>

<p>
Hay tres semáforos, ¿quién inicializa cada uno de ellos?
</p>

<ul class="org-ul">
<li>El proceso inicializador de dispositivos</li>
</ul>


<p>
¿Quién ejecuta al proceso driver?
</p>

<ul class="org-ul">
<li>El proceso que pide la solicitud de E/S</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcacc88c" class="outline-3">
<h3 id="orgcacc88c">Clase 36</h3>
<div class="outline-text-3" id="text-orgcacc88c">
</div>
<div id="outline-container-org229a695" class="outline-4">
<h4 id="org229a695">Sistema de archivos</h4>
<div class="outline-text-4" id="text-org229a695">
<ul class="org-ul">
<li><p>
Archivo: Unidad de almacenamiento de archivos}
</p>

<p>
Se utiliza un modelo de archivo como modelos de coleccion lineal
de bytes (bloques).
</p></li>

<li>Directorio: Estructura para mapear nombres a archivos</li>
</ul>
</div>
</div>

<div id="outline-container-orgf69434c" class="outline-4">
<h4 id="orgf69434c">Bloques secuenciales</h4>
<div class="outline-text-4" id="text-orgf69434c">
<ul class="org-ul">
<li>Pros:

<ul class="org-ul">
<li>Acceso aleatorio.</li>

<li>Un bloque dañado sólo saña un archivo</li>
</ul></li>

<li>Contras: Fragmentación -&gt; Compactación

<ul class="org-ul">
<li>Difícil añadir o eliminar bloques al interior del archivo.</li>

<li>Hay que saber de antemano la cnatidad de bloques que hay que
asignar.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc609348" class="outline-4">
<h4 id="orgc609348">Bloques enlazados</h4>
<div class="outline-text-4" id="text-orgc609348">
<ul class="org-ul">
<li>Los bloques de un archivo se estructuran en una lista ligada
contenida en él mismo.</li>

<li>En el directorio se guarda un apuntador al primer y último
bloque.</li>

<li>Cada bloque tien un apuntador al siguiente.</li>
</ul>


<p>
Pros:
</p>

<ul class="org-ul">
<li>No hay fragemntación interna.</li>

<li>No hace falta realizar compactación (aunque ayuda defrag)</li>
</ul>


<p>
Cons:
</p>

<ul class="org-ul">
<li>Acceso secuencial únicamente, Avanzar al bloque siguiente
implica una lectora de disco.</li>

<li>Sobrecarga de espacio por los apuntadores.</li>
</ul>


<p>
Para minimizar las desventajas, en lugar de bloques: conjuntos de
tamaño fijo de bloques consecutivos.
</p>
</div>
</div>

<div id="outline-container-org8dac7c9" class="outline-4">
<h4 id="org8dac7c9">Tabla de asignación de archivo (FAT)</h4>
<div class="outline-text-4" id="text-org8dac7c9">
<p>
En lugar de tener una cadena de bloques distribuida en distintas
localizaciones, los consolidamos en una tabla de asignación
almacenados en una región compacta del disco.
</p>

<ul class="org-ul">
<li>Variación del esquema enlazado.</li>

<li>El disco se divide en clusters.</li>

<li>Se hace una tabla que contiene una entrada por cluster.</li>

<li>Si el cluster c es el i-ésimo del archivo f, la entrada c-+esima
de la tabla contiene el número del cluste i+1-eśimo de f.</li>

<li>Una entrada de directorio contiene un apuntador al prmer y
útlimo cluster del archivo.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org9597a9c" class="outline-2">
<h2 id="org9597a9c">Tareas <code>[4/5]</code></h2>
<div class="outline-text-2" id="text-org9597a9c">
<ul class="org-ul">
<li class="on"><code>[X]</code> Práctica 1: Reimplementar la función timer<sub>sleep</sub> para que no
utilice espera ocupada.</li>
<li class="on"><code>[X]</code> Tarea 1:
Enviar a: alanmartinez-012@ciencias.unam.mx
Asunto: Tarea1SO 2023-2
Cuerpo: - Nombre Completo
<ul class="org-ul">
<li>No Cuenta</li>
</ul></li>
<li class="on"><code>[X]</code> Práctica 2</li>
<li class="on"><code>[X]</code> Tarea 2</li>
<li class="off"><code>[&#xa0;]</code> Primer Parcial: Miércoles 29 de marzo
<ul class="org-ul">
<li><i>Embriones</i> de los Sistemas Operativos</li>
<li>Ogranización de Computadoras</li>
<li>Interrupciones</li>
<li>Llamadas al sistema y señales</li>
<li>Procesos: Protocolos y semáforos</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2024-08-19 Mon 12:06</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
